/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2010 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

#ifndef _PE_PE1_REG_L9B0_H_
#define _PE_PE1_REG_L9B0_H_

/*-----------------------------------------------------------------------------
	0x1300 pe1_l_top_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 load_time                       : 1;	//     0
	UINT32 load_enable                     : 1;	//     1
	UINT32 load_type                       : 1;	//     2
} PE_L9B0_PE1_L_TOP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1304 pe1_l_top_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 width                           :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 height                          :12;	// 16:27
} PE_L9B0_PE1_L_TOP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1308 pe1_l_top_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_positon                     : 1;	//     0
	UINT32 chroma_sel                      : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 disp_active_mux                 : 1;	//     4
	UINT32 async_delay_mode                : 1;	//     5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 vdpulse_pos                     :11;	//  8:18
} PE_L9B0_PE1_L_TOP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x130c pe1_l_top_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 vcnt                            :12;	//  0:11
	UINT32 va_pe1_in                       : 1;	//    12
	UINT32 va_pe1_out                      : 1;	//    13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 stat_tpg                        : 1;	//    16
	UINT32 stat_gt                         : 3;	// 17:19
	UINT32 stat_crg_lsr                    : 3;	// 20:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 stat_crg_shp                    : 3;	// 24:26
	UINT32 stat_dce                        : 1;	//    27
	UINT32 stat_cen                        : 1;	//    28
	UINT32 stat_wb                         : 1;	//    29
	UINT32 stat_gmc                        : 2;	// 30:31
} PE_L9B0_PE1_L_TOP_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1320 pe1_l_win1_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 6;	//  0: 5 reserved
	UINT32 win_outside                     : 1;	//     6
	UINT32 win_en                          : 1;	//     7
	UINT32 bdr_alpha                       : 5;	//  8:12
	UINT32 bdr_wid                         : 2;	// 13:14
	UINT32 bdr_en                          : 1;	//    15
	UINT32 cr5                             : 5;	// 16:20
	UINT32 cb5                             : 5;	// 21:25
	UINT32 yy6                             : 6;	// 26:31
} PE_L9B0_PE1_L_WIN1_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1324 pe1_l_win1_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y0                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN1_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1328 pe1_l_win1_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y1                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN1_CTRL_02;

/*-----------------------------------------------------------------------------
	0x132c pe1_l_win1_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y0                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN1_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1330 pe1_l_win1_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y1                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN1_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1334 pe1_l_win2_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 6;	//  0: 5 reserved
	UINT32 win_outside                     : 1;	//     6
	UINT32 win_en                          : 1;	//     7
	UINT32 bdr_alpha                       : 5;	//  8:12
	UINT32 bdr_wid                         : 2;	// 13:14
	UINT32 bdr_en                          : 1;	//    15
	UINT32 cr5                             : 5;	// 16:20
	UINT32 cb5                             : 5;	// 21:25
	UINT32 yy6                             : 6;	// 26:31
} PE_L9B0_PE1_L_WIN2_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1338 pe1_l_win2_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y0                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN2_CTRL_01;

/*-----------------------------------------------------------------------------
	0x133c pe1_l_win2_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y1                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN2_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1340 pe1_l_win2_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y0                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN2_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1344 pe1_l_win2_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y1                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN2_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1350 pe1_l_apl_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_win_ctrl_x0                 :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 apl_win_ctrl_y0                 :12;	// 16:27
} PE_L9B0_PE1_L_APL_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1354 pe1_l_apl_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_win_ctrl_x1                 :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 apl_win_ctrl_y1                 :12;	// 16:27
} PE_L9B0_PE1_L_APL_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1358 pe1_l_apl_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_position                    : 2;	//  0: 1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 apl_y_type                      : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 act_win_mode                    : 1;	//     8
} PE_L9B0_PE1_L_APL_CTRL_02;

/*-----------------------------------------------------------------------------
	0x135c pe1_l_apl_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_y                           :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 apl_rgb                         :10;	// 16:25
} PE_L9B0_PE1_L_APL_STAT_00;

/*-----------------------------------------------------------------------------
	0x1360 pe1_l_apl_stat_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_b                           :10;	//  0: 9
	UINT32 apl_g                           :10;	// 10:19
	UINT32 apl_r                           :10;	// 20:29
} PE_L9B0_PE1_L_APL_STAT_01;

/*-----------------------------------------------------------------------------
	0x1364 pe1_l_apl_stat_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_y__other_side               :10;	//  0: 9
} PE_L9B0_PE1_L_APL_STAT_02;

/*-----------------------------------------------------------------------------
	0x1368 pe1_l_apl_stat_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_b__other_side               :10;	//  0: 9
	UINT32 apl_g__other_side               :10;	// 10:19
	UINT32 apl_r__other_side               :10;	// 20:29
} PE_L9B0_PE1_L_APL_STAT_03;

/*-----------------------------------------------------------------------------
	0x1370 pe1_l_tpg_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_enable                      : 1;	//     0
	UINT32 pattern_type                    : 2;	//  1: 2
	UINT32                                 : 1;	//     3 reserved
	UINT32 blend_alpha                     : 4;	//  4: 7
	UINT32 blt_size_x                      :12;	//  8:19
	UINT32 blt_size_y                      :12;	// 20:31
} PE_L9B0_PE1_L_TPG_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1374 pe1_l_tpg_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gradation_stride                : 7;	//  0: 6
	UINT32 gradation_direction             : 1;	//     7
	UINT32 gradation_bar_en                : 4;	//  8:11
} PE_L9B0_PE1_L_TPG_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1378 pe1_l_tpg_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 patch_en                        :16;	//  0:15
} PE_L9B0_PE1_L_TPG_CTRL_02;

/*-----------------------------------------------------------------------------
	0x137c pe1_l_tpg_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 patch_inout_sel                 :16;	//  0:15
} PE_L9B0_PE1_L_TPG_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1380 pe1_l_tpg_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bg_color_r                      :10;	//  0: 9
	UINT32 bg_color_b                      :10;	// 10:19
	UINT32 bg_color_g                      :10;	// 20:29
} PE_L9B0_PE1_L_TPG_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1384 pe1_l_tpg_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_indir_addr                  : 7;	//  0: 6
	UINT32                                 : 5;	//  7:11 reserved
	UINT32 tpg_indir_ai_en                 : 1;	//    12
} PE_L9B0_PE1_L_TPG_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x1388 pe1_l_tpg_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_indir_data                  ;   	// 31: 0
} PE_L9B0_PE1_L_TPG_IA_DATA;

/*-----------------------------------------------------------------------------
	0x13a0 pe1_l_film_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 vignetting_enable               : 1;	//     0
	UINT32 film_contrast_enable            : 1;	//     1
	UINT32                                 : 6;	//  2: 7 reserved
	UINT32 contrast_alpha                  : 8;	//  8:15
	UINT32 contrast_delta_max              : 8;	// 16:23
	UINT32 vignetting_gain                 : 8;	// 24:31
} PE_L9B0_PE1_L_FILM_CTRL_00;

/*-----------------------------------------------------------------------------
	0x13a4 pe1_l_film_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 noise_gen_enable                : 1;	//     0
	UINT32 noise_frame_rate                : 3;	//  1: 3
	UINT32 noise_size                      : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 noise_gain                      : 8;	//  8:15
} PE_L9B0_PE1_L_FILM_CTRL_01;

/*-----------------------------------------------------------------------------
	0x13a8 pe1_l_film_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tone_gain                       : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 tone_offset                     : 6;	//  8:13
} PE_L9B0_PE1_L_FILM_CTRL_02;

/*-----------------------------------------------------------------------------
	0x13b0 pe1_l_win3_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 6;	//  0: 5 reserved
	UINT32 win_outside                     : 1;	//     6
	UINT32 win_en                          : 1;	//     7
	UINT32 bdr_alpha                       : 5;	//  8:12
	UINT32 bdr_wid                         : 2;	// 13:14
	UINT32 bdr_en                          : 1;	//    15
	UINT32 cr5                             : 5;	// 16:20
	UINT32 cb5                             : 5;	// 21:25
	UINT32 yy6                             : 6;	// 26:31
} PE_L9B0_PE1_L_WIN3_CTRL_00;

/*-----------------------------------------------------------------------------
	0x13b4 pe1_l_win3_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y0                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN3_CTRL_01;

/*-----------------------------------------------------------------------------
	0x13b8 pe1_l_win3_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y1                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN3_CTRL_02;

/*-----------------------------------------------------------------------------
	0x13bc pe1_l_win3_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y0                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN3_CTRL_03;

/*-----------------------------------------------------------------------------
	0x13c0 pe1_l_win3_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y1                       :12;	// 16:27
} PE_L9B0_PE1_L_WIN3_CTRL_04;

/*-----------------------------------------------------------------------------
	0x13d0 pe1_l_derh_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsum_mode                       : 2;	//  0: 1
	UINT32 hsum_mode                       : 2;	//  2: 3
	UINT32 vsum121_en                      : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 vertical_min_max                : 2;	//  8: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 a_flt_mux                       : 2;	// 16:17
	UINT32 a_e_mux                         : 2;	// 18:19
	UINT32 t_mux                           : 1;	//    20
	UINT32                                 : 3;	// 21:23 reserved
	UINT32 a_gen_width                     : 4;	// 24:27
} PE_L9B0_PE1_L_DERH_CTRL_00;

/*-----------------------------------------------------------------------------
	0x13d4 pe1_l_derh_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 a_gen_of_y                      : 8;	//  0: 7
	UINT32 a_gen_of_c                      : 8;	//  8:15
	UINT32 avg_flt_mode                    : 3;	// 16:18
	UINT32 avg_flt_en                      : 1;	//    19
	UINT32                                 : 4;	// 20:23 reserved
	UINT32 max_flt_mode                    : 3;	// 24:26
} PE_L9B0_PE1_L_DERH_CTRL_01;

/*-----------------------------------------------------------------------------
	0x13d8 pe1_l_derh_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 a_exp_gain_ctrl_y0              : 4;	//  0: 3
	UINT32 a_exp2_gain_ctrl_x0             : 4;	//  4: 7
	UINT32 a_exp2_gain_ctrl_y1             : 4;	//  8:11
	UINT32 a_exp2_gain_ctrl_x1             : 4;	// 12:15
	UINT32 a_avg2_flt_wid                  : 4;	// 16:19
	UINT32 a_avg2_flt_en                   : 1;	//    20
	UINT32                                 : 3;	// 21:23 reserved
	UINT32 a_exp_max2_en                   : 1;	//    24
	UINT32                                 : 1;	//    25 reserved
	UINT32 y_sum_mode                      : 2;	// 26:27
} PE_L9B0_PE1_L_DERH_CTRL_02;

/*-----------------------------------------------------------------------------
	0x13dc pe1_l_derh_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 5;	//  0: 4 reserved
	UINT32 a_mux_for_edge_gaintable        : 3;	//  5: 7
	UINT32                                 : 9;	//  8:16 reserved
	UINT32 a_mux_for_detail_filter         : 3;	// 17:19
	UINT32                                 : 1;	//    20 reserved
	UINT32 a_mux_for_edge_filter           : 3;	// 21:23
	UINT32 a_scaling_flat_filter           : 4;	// 24:27
	UINT32                                 : 1;	//    28 reserved
	UINT32 a_mux_for_flat_filter           : 3;	// 29:31
} PE_L9B0_PE1_L_DERH_CTRL_03;

/*-----------------------------------------------------------------------------
	0x13e0 pe1_l_derh_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 1;	//     0 reserved
	UINT32 reg_dbg_scale                   : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 sum_mux                         : 4;	//  4: 7
	UINT32 reg_enh_en_cc                   : 3;	//  8:10
	UINT32                                 : 1;	//    11 reserved
	UINT32 reg_enh_en_yy                   : 3;	// 12:14
} PE_L9B0_PE1_L_DERH_CTRL_04;

/*-----------------------------------------------------------------------------
	0x13e4 pe1_l_derh_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vmm_param                   : 2;	//  0: 1
	UINT32                                 : 6;	//  2: 7 reserved
	UINT32 reg_csft_gain                   : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 reg_th_gain_edge                : 6;	// 16:21
	UINT32 reg_th_gain_flat                : 2;	// 22:23
	UINT32 reg_th_manual_th                : 7;	// 24:30
	UINT32 reg_th_manual_en                : 1;	//    31
} PE_L9B0_PE1_L_DERH_CTRL_05;

/*-----------------------------------------------------------------------------
	0x13e8 pe1_l_derh_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 edge_filter_white_gain          : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 edge_filter_black_gain          : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 reg_amean_en                    : 1;	//    24
	UINT32                                 : 1;	//    25 reserved
	UINT32 edge_filter_v_tap               : 2;	// 26:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 edge_c_filter_en                : 1;	//    30
	UINT32 edge_y_filter_en                : 1;	//    31
} PE_L9B0_PE1_L_DERH_CTRL_06;

/*-----------------------------------------------------------------------------
	0x13ec pe1_l_derh_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 :24;	//  0:23 reserved
	UINT32 flat_filter_gain                : 6;	// 24:29
	UINT32                                 : 1;	//    30 reserved
	UINT32 flat_filter_en                  : 1;	//    31
} PE_L9B0_PE1_L_DERH_CTRL_07;

/*-----------------------------------------------------------------------------
	0x13f0 pe1_l_derh_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 amod_ctrl0_y0                   : 8;	//  0: 7
	UINT32 amod_ctrl0_x0                   : 8;	//  8:15
	UINT32 amod_ctrl0_y1                   : 8;	// 16:23
	UINT32 amod_ctrl0_x1                   : 8;	// 24:31
} PE_L9B0_PE1_L_DERH_CTRL_08;

/*-----------------------------------------------------------------------------
	0x13f4 pe1_l_derh_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 amod_ctrl1_x0                   : 8;	//  0: 7
	UINT32 amod_ctrl1_x1                   : 8;	//  8:15
	UINT32 y_c_mux_control                 : 3;	// 16:18
	UINT32 chroma_weight                   : 5;	// 19:23
} PE_L9B0_PE1_L_DERH_CTRL_09;

/*-----------------------------------------------------------------------------
	0x1400 pe1_l_derv_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 der_v_en                        : 1;	//     0
	UINT32 der_gain_mapping                : 2;	//  1: 2
	UINT32 bif_en                          : 1;	//     3
	UINT32 output_mux                      : 4;	//  4: 7
	UINT32 bif_manual_th                   : 8;	//  8:15
	UINT32 th_gain                         : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 th_mode                         : 1;	//    24
} PE_L9B0_PE1_L_DERV_CTRL_0;

/*-----------------------------------------------------------------------------
	0x1404 pe1_l_derv_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 csft_gain                       : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 csft_mode                       : 1;	//     8
} PE_L9B0_PE1_L_DERV_CTRL_1;

/*-----------------------------------------------------------------------------
	0x1408 pe1_l_derv_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 mmd_sel                         : 3;	//  0: 2
	UINT32                                 : 1;	//     3 reserved
	UINT32 max_sel                         : 3;	//  4: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 avg_sel                         : 2;	//  8: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 gain_th1                        : 8;	// 16:23
	UINT32 gain_th2                        : 8;	// 24:31
} PE_L9B0_PE1_L_DERV_CTRL_2;

/*-----------------------------------------------------------------------------
	0x140c pe1_l_derv_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gain_b                          : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 gain_w                          : 7;	//  8:14
} PE_L9B0_PE1_L_DERV_CTRL_3;

/*-----------------------------------------------------------------------------
	0x1410 pe1_l_dp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pe1_l_dp_ctrl_00                : 3;	//  0: 2
} PE_L9B0_PE1_L_DP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1414 pe1_l_dp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_gain_b                     : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 edge_gain_w                     : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 texture_gain_b                  : 7;	// 16:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 texture_gain_w                  : 7;	// 24:30
} PE_L9B0_PE1_L_DP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1418 pe1_l_dp_ctrl_02 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x141c pe1_l_dp_ctrl_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1420 pe1_l_coring_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tm_h                            :16;	//  0:15
	UINT32 tm_v                            :16;	// 16:31
} PE_L9B0_PE1_L_CORING_STAT_00;

/*-----------------------------------------------------------------------------
	0x1424 pe1_l_coring_stat_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tm_h                            :16;	//  0:15
} PE_L9B0_PE1_L_CORING_STAT_01;

/*-----------------------------------------------------------------------------
	0x1428 pe1_l_coring_stat_02 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x142c pe1_l_coring_stat_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1470 pe1_l_derh_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 a2g_mode_e                      : 1;	//     0
	UINT32 a2g_mode_f                      : 1;	//     1
	UINT32                                 : 6;	//  2: 7 reserved
	UINT32 a2g_mgain_e                     : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 a2g_mgain_f                     : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 debug_mode                      : 4;	// 24:27
} PE_L9B0_PE1_L_DERH_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x1474 pe1_l_derh_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 e_gain_th1                      : 8;	//  0: 7
	UINT32 e_gain_th2                      : 8;	//  8:15
	UINT32 f_gain_th1                      : 8;	// 16:23
	UINT32 f_gain_th2                      : 8;	// 24:31
} PE_L9B0_PE1_L_DERH_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x1478 pe1_l_derh_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 e_gain_max                      : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 f_gain_max                      : 6;	//  8:13
} PE_L9B0_PE1_L_DERH_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x147c pe1_l_derh_ctrl_0d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1490 pe1_l_sp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_enhance_enable             : 1;	//     0
	UINT32                                 :11;	//  1:11 reserved
	UINT32 edge_operator_selection         : 2;	// 12:13
} PE_L9B0_PE1_L_SP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1494 pe1_l_sp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 white_gain                      : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 black_gain                      : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 horizontal_gain                 : 8;	// 16:23
	UINT32 vertical_gain                   : 8;	// 24:31
} PE_L9B0_PE1_L_SP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1498 pe1_l_sp_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 sobel_weight                    : 8;	//  0: 7
	UINT32 laplacian_weight                : 8;	//  8:15
	UINT32 sobel_manual_mode_en            : 1;	//    16
	UINT32                                 : 7;	// 17:23 reserved
	UINT32 sobel_manual_gain               : 8;	// 24:31
} PE_L9B0_PE1_L_SP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x149c pe1_l_sp_ctrl_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x14a0 pe1_l_sp_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 display_mode                    : 4;	//  8:11
	UINT32 gx_weight_manual_mode           : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 gx_weight_manual_gain           : 8;	// 16:23
} PE_L9B0_PE1_L_SP_CTRL_04;

/*-----------------------------------------------------------------------------
	0x14a8 pe1_l_sp_ctrl_05 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x14ac pe1_l_sp_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lap_h_mode                      : 2;	//  0: 1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 lap_v_mode                      : 1;	//     4
} PE_L9B0_PE1_L_SP_CTRL_06;

/*-----------------------------------------------------------------------------
	0x14b0 pe1_l_sp_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_en                           : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 gb_mode                         : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 gb_x1                           : 8;	//  8:15
	UINT32 gb_y1                           : 8;	// 16:23
} PE_L9B0_PE1_L_SP_CTRL_07;

/*-----------------------------------------------------------------------------
	0x14b4 pe1_l_sp_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_x2                           : 8;	//  0: 7
	UINT32 gb_y2                           : 8;	//  8:15
	UINT32 gb_y3                           : 8;	// 16:23
} PE_L9B0_PE1_L_SP_CTRL_08;

/*-----------------------------------------------------------------------------
	0x14b8 pe1_l_sp_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_x_l0                       : 8;	//  0: 7
	UINT32 lum1_x_l1                       : 8;	//  8:15
	UINT32 lum1_x_h0                       : 8;	// 16:23
	UINT32 lum1_x_h1                       : 8;	// 24:31
} PE_L9B0_PE1_L_SP_CTRL_09;

/*-----------------------------------------------------------------------------
	0x14bc pe1_l_sp_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_y0                         : 8;	//  0: 7
	UINT32 lum1_y1                         : 8;	//  8:15
	UINT32 lum1_y2                         : 8;	// 16:23
	UINT32 lum2_x_l0                       : 8;	// 24:31
} PE_L9B0_PE1_L_SP_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x14c0 pe1_l_sp_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_x_l1                       : 8;	//  0: 7
	UINT32 lum2_x_h0                       : 8;	//  8:15
	UINT32 lum2_x_h1                       : 8;	// 16:23
	UINT32 lum2_y0                         : 8;	// 24:31
} PE_L9B0_PE1_L_SP_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x14c4 pe1_l_sp_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_y1                         : 8;	//  0: 7
	UINT32 lum2_y2                         : 8;	//  8:15
} PE_L9B0_PE1_L_SP_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x14d0 pe1_l_debug_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable_debug_mode               : 1;	//     0
	UINT32                                 : 8;	//  1: 8 reserved
	UINT32 show_sqm2                       : 1;	//     9
	UINT32 sqm2_debug_image                : 4;	// 10:13
	UINT32                                 : 1;	//    14 reserved
	UINT32 show_bbd                        : 2;	// 15:16
	UINT32 bbd_line_width                  : 3;	// 17:19
	UINT32 show_apl                        : 1;	//    20
} PE_L9B0_PE1_L_DEBUG_CTRL_00;

/*-----------------------------------------------------------------------------
	0x14d4 pe1_l_debug_ctrl_01 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x14f0 pe1_l_mp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_enhance_enable             : 1;	//     0
	UINT32                                 :11;	//  1:11 reserved
	UINT32 edge_operator_selection         : 2;	// 12:13
} PE_L9B0_PE1_L_MP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x14f4 pe1_l_mp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 white_gain                      : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 black_gain                      : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 horizontal_gain                 : 8;	// 16:23
	UINT32 vertical_gain                   : 8;	// 24:31
} PE_L9B0_PE1_L_MP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x14f8 pe1_l_mp_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 sobel_weight                    : 8;	//  0: 7
	UINT32 laplacian_weight                : 8;	//  8:15
	UINT32 sobel_manual_mode_en            : 1;	//    16
	UINT32                                 : 7;	// 17:23 reserved
	UINT32 sobel_manual_gain               : 8;	// 24:31
} PE_L9B0_PE1_L_MP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x14fc pe1_l_mp_ctrl_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1500 pe1_l_mp_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 display_mode                    : 4;	//  8:11
	UINT32 gx_weight_manual_mode           : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 gx_weight_manual_gain           : 8;	// 16:23
} PE_L9B0_PE1_L_MP_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1508 pe1_l_mp_ctrl_05 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x150c pe1_l_mp_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lap_h_mode                      : 3;	//  0: 2
	UINT32                                 : 1;	//     3 reserved
	UINT32 lap_v_mode                      : 3;	//  4: 6
} PE_L9B0_PE1_L_MP_CTRL_06;

/*-----------------------------------------------------------------------------
	0x1510 pe1_l_mp_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_en                           : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 gb_mode                         : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 gb_x1                           : 8;	//  8:15
	UINT32 gb_y1                           : 8;	// 16:23
} PE_L9B0_PE1_L_MP_CTRL_07;

/*-----------------------------------------------------------------------------
	0x1514 pe1_l_mp_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_x2                           : 8;	//  0: 7
	UINT32 gb_y2                           : 8;	//  8:15
	UINT32 gb_y3                           : 8;	// 16:23
} PE_L9B0_PE1_L_MP_CTRL_08;

/*-----------------------------------------------------------------------------
	0x1518 pe1_l_mp_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_x_l0                       : 8;	//  0: 7
	UINT32 lum1_x_l1                       : 8;	//  8:15
	UINT32 lum1_x_h0                       : 8;	// 16:23
	UINT32 lum1_x_h1                       : 8;	// 24:31
} PE_L9B0_PE1_L_MP_CTRL_09;

/*-----------------------------------------------------------------------------
	0x151c pe1_l_mp_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_y0                         : 8;	//  0: 7
	UINT32 lum1_y1                         : 8;	//  8:15
	UINT32 lum1_y2                         : 8;	// 16:23
	UINT32 lum2_x_l0                       : 8;	// 24:31
} PE_L9B0_PE1_L_MP_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x1520 pe1_l_mp_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_x_l1                       : 8;	//  0: 7
	UINT32 lum2_x_h0                       : 8;	//  8:15
	UINT32 lum2_x_h1                       : 8;	// 16:23
	UINT32 lum2_y0                         : 8;	// 24:31
} PE_L9B0_PE1_L_MP_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x1524 pe1_l_mp_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_y1                         : 8;	//  0: 7
	UINT32 lum2_y2                         : 8;	//  8:15
} PE_L9B0_PE1_L_MP_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x1530 pe1_l_cti_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 cti_en                          : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 tap_size                        : 3;	//  4: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 cti_gain                        : 8;	//  8:15
} PE_L9B0_PE1_L_CTI_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1534 pe1_l_cti_ctrl_01 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1538 pe1_l_cti_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ycm_en0                         : 1;	//     0
	UINT32 ycm_en1                         : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 ycm_band_sel                    : 3;	//  4: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 ycm_diff_th                     : 8;	//  8:15
	UINT32 ycm_y_gain                      : 4;	// 16:19
	UINT32 ycm_c_gain                      : 4;	// 20:23
} PE_L9B0_PE1_L_CTI_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1550 pe1_l_blur_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32 coring_en                       : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 direction                       : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 gain                            : 8;	//  8:15
	UINT32 coring_min                      : 8;	// 16:23
	UINT32 coring_max                      : 8;	// 24:31
} PE_L9B0_PE1_L_BLUR_CTRL;

/*-----------------------------------------------------------------------------
	0x1560 pe1_l_coring_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ga_max                          : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 ga_th0                          : 8;	//  8:15
	UINT32 ga_th1                          : 8;	// 16:23
	UINT32 amap1_sel                       : 2;	// 24:25
	UINT32 amap2_sel                       : 2;	// 26:27
	UINT32 edge_a_sel                      : 1;	//    28
	UINT32 debug_a_sel                     : 1;	//    29
} PE_L9B0_PE1_L_CORING_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1564 pe1_l_coring_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_sel                         : 3;	//  0: 2
	UINT32                                 : 1;	//     3 reserved
	UINT32 avg_sel                         : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 a2tw_min                        : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 a2tw_th0                        : 8;	// 16:23
	UINT32 a2tw_th1                        : 8;	// 24:31
} PE_L9B0_PE1_L_CORING_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1568 pe1_l_coring_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 nrv_en                          : 1;	//     0
	UINT32                                 : 7;	//  1: 7 reserved
	UINT32 nrv_th1                         : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 nrv_th2                         : 6;	// 16:21
} PE_L9B0_PE1_L_CORING_CTRL_02;

/*-----------------------------------------------------------------------------
	0x156c pe1_l_coring_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 nrh_en                          : 1;	//     0
	UINT32                                 : 7;	//  1: 7 reserved
	UINT32 nrh_th1                         : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 nrh_th2                         : 6;	// 16:21
} PE_L9B0_PE1_L_CORING_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1570 pe1_l_coring_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dflt_sel                        : 2;	//  0: 1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 var_th                          :11;	//  4:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 coring_mode1                    : 2;	// 16:17
	UINT32 coring_mode2                    : 2;	// 18:19
	UINT32 ac_direction                    : 1;	//    20
	UINT32 tflt_en                         : 1;	//    21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 exp_mode                        : 2;	// 24:25
} PE_L9B0_PE1_L_CORING_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1574 pe1_l_coring_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gt_max                          : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 gt_th0                          : 8;	//  8:15
	UINT32 gt_th1                          : 8;	// 16:23
	UINT32 a2tw_en                         : 1;	//    24
} PE_L9B0_PE1_L_CORING_CTRL_05;

/*-----------------------------------------------------------------------------
	0x1578 pe1_l_coring_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gt_th0a                         : 8;	//  0: 7
	UINT32 gt_th0b                         : 8;	//  8:15
	UINT32 gt_gain0a                       : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 gt_gain0b                       : 6;	// 24:29
} PE_L9B0_PE1_L_CORING_CTRL_06;

/*-----------------------------------------------------------------------------
	0x157c pe1_l_coring_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 g_th0                           : 8;	//  0: 7
	UINT32 g_th1                           : 8;	//  8:15
	UINT32 amap_gain                       : 7;	// 16:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 tmap_gain                       : 7;	// 24:30
} PE_L9B0_PE1_L_CORING_CTRL_07;

/*-----------------------------------------------------------------------------
	0x1580 pe1_l_coring_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 mp_coring_mode                  : 2;	//  0: 1
	UINT32 sp_coring_mode                  : 2;	//  2: 3
	UINT32 mp_coring_en                    : 1;	//     4
	UINT32 sp_coring_en                    : 1;	//     5
} PE_L9B0_PE1_L_CORING_CTRL_08;

/*-----------------------------------------------------------------------------
	0x1584 pe1_l_coring_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_gain_b                     : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 edge_gain_w                     : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 texture_gain_b                  : 7;	// 16:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 texture_gain_w                  : 7;	// 24:30
} PE_L9B0_PE1_L_CORING_CTRL_09;

/*-----------------------------------------------------------------------------
	0x1590 pe1_l_dj_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edf_en                          : 1;	//     0
	UINT32 hv_filter_en                    : 1;	//     1
	UINT32 g0_feature_norm_en              : 1;	//     2
	UINT32 g0_f2g_mapping_en               : 1;	//     3
	UINT32 line_variation_mode             : 1;	//     4
	UINT32 l_type_protection               : 1;	//     5
	UINT32 center_blur_en                  : 1;	//     6
	UINT32 direction_type_mode             : 1;	//     7
	UINT32 count_diff_th                   : 5;	//  8:12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 output_mux                      : 3;	// 16:18
	UINT32                                 : 3;	// 19:21 reserved
	UINT32 n_avg_mode                      : 1;	//    22
	UINT32                                 : 1;	//    23 reserved
	UINT32 line_variation_diff__threshold  : 8;	// 24:31
} PE_L9B0_PE1_L_DJ_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1594 pe1_l_dj_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 level_th                        : 8;	//  0: 7
	UINT32 protect_th                      : 8;	//  8:15
	UINT32 n_avg_gain                      : 8;	// 16:23
} PE_L9B0_PE1_L_DJ_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1598 pe1_l_dj_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edf_count_min                   : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 edf_count_max                   : 5;	//  8:12
} PE_L9B0_PE1_L_DJ_CTRL_02;

/*-----------------------------------------------------------------------------
	0x159c pe1_l_dj_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dj_h_count_min                  : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 dj_h_count_max                  : 5;	//  8:12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 dj_v_count_min                  : 5;	// 16:20
	UINT32                                 : 4;	// 21:24 reserved
	UINT32 dj_v_count_max                  : 4;	// 25:28
} PE_L9B0_PE1_L_DJ_CTRL_03;

/*-----------------------------------------------------------------------------
	0x15a0 pe1_l_level_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 y_offset                        :10;	//  4:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 center_position                 : 8;	// 16:23
	UINT32 y_gain                          : 8;	// 24:31
} PE_L9B0_PE1_L_LEVEL_CTRL_00;

/*-----------------------------------------------------------------------------
	0x15a4 pe1_l_vspyc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32 graycolor_enable                : 1;	//     1
	UINT32 color_only_enable               : 1;	//     2
	UINT32 cb_info                         : 1;	//     3
	UINT32 cr_info                         : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 center_position                 : 8;	//  8:15
	UINT32 contrast                        :10;	// 16:25
} PE_L9B0_PE1_L_VSPYC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x15a8 pe1_l_vspyc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 saturation                      : 8;	//  8:15
	UINT32 brightness                      :10;	// 16:25
} PE_L9B0_PE1_L_VSPYC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x15b0 pe1_l_vsprgb_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 contrast                        :10;	//  0: 9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 center_position                 : 8;	// 12:19
	UINT32 brightness                      :10;	// 20:29
	UINT32                                 : 1;	//    30 reserved
	UINT32 enable                          : 1;	//    31
} PE_L9B0_PE1_L_VSPRGB_CTRL_00;

/*-----------------------------------------------------------------------------
	0x15c0 pe1_l_xvy_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 outputcsc_en                    : 1;	//     0
	UINT32 degamma_en                      : 1;	//     1
	UINT32 pcc_en                          : 1;	//     2
	UINT32 gamma_en                        : 1;	//     3
	UINT32 scaler_en                       : 1;	//     4
	UINT32 hsv_hsl_selection               : 1;	//     5
	UINT32 s_adpative_scaler_enable        : 1;	//     6
} PE_L9B0_PE1_L_XVY_CTRL_00;

/*-----------------------------------------------------------------------------
	0x15c4 pe1_l_xvy_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef1                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef0                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_01;

/*-----------------------------------------------------------------------------
	0x15c8 pe1_l_xvy_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef3                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef2                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_02;

/*-----------------------------------------------------------------------------
	0x15cc pe1_l_xvy_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef5                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef4                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_03;

/*-----------------------------------------------------------------------------
	0x15d0 pe1_l_xvy_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef7                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef6                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_04;

/*-----------------------------------------------------------------------------
	0x15d4 pe1_l_xvy_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst0                     :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 r_csc_coef8                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_05;

/*-----------------------------------------------------------------------------
	0x15d8 pe1_l_xvy_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst2                     :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 r_csc_ofst1                     :11;	// 16:26
} PE_L9B0_PE1_L_XVY_CTRL_06;

/*-----------------------------------------------------------------------------
	0x15dc pe1_l_xvy_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst4                     :14;	//  0:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 r_csc_ofst3                     :14;	// 16:29
} PE_L9B0_PE1_L_XVY_CTRL_07;

/*-----------------------------------------------------------------------------
	0x15e0 pe1_l_xvy_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef0                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_ofst5                     :14;	// 16:29
} PE_L9B0_PE1_L_XVY_CTRL_08;

/*-----------------------------------------------------------------------------
	0x15e4 pe1_l_xvy_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef2                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef1                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_09;

/*-----------------------------------------------------------------------------
	0x15e8 pe1_l_xvy_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef4                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef3                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x15ec pe1_l_xvy_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef6                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef5                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x15f0 pe1_l_xvy_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef8                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef7                     :15;	// 16:30
} PE_L9B0_PE1_L_XVY_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x15f4 pe1_l_xvy_ctrl_0d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 scaler                          : 8;	//  0: 7
} PE_L9B0_PE1_L_XVY_CTRL_0D;

/*-----------------------------------------------------------------------------
	0x1600 pe1_l_cen_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 2;	//  0: 1 reserved
	UINT32 select_hsv                      : 1;	//     2
	UINT32 select_rgb                      : 1;	//     3
	UINT32                                 : 1;	//     4 reserved
	UINT32 vsp_sel                         : 1;	//     5
	UINT32 global_apl_sel                  : 1;	//     6
	UINT32 reg_cen_bypass                  : 1;	//     7
	UINT32 reg_cen_debug_mode              : 1;	//     8
	UINT32 debugging_mode_core             : 1;	//     9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 v_scaler_en                     : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 demo_mode                       : 8;	// 16:23
	UINT32                                 : 7;	// 24:30 reserved
	UINT32 win_control_mode                : 1;	//    31
} PE_L9B0_PE1_L_CEN_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1604 pe1_l_cen_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 show_color_region0              : 8;	//  0: 7
	UINT32 show_color_region1              : 8;	//  8:15
	UINT32                                 : 8;	// 16:23 reserved
	UINT32 color_region_en1                : 8;	// 24:31
} PE_L9B0_PE1_L_CEN_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1608 pe1_l_cen_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ihsv_sgain                      : 8;	//  0: 7
	UINT32 ihsv_vgain                      : 8;	//  8:15
} PE_L9B0_PE1_L_CEN_CTRL_02;

/*-----------------------------------------------------------------------------
	0x160c pe1_l_cen_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ihsv_hoffset                    : 8;	//  0: 7
	UINT32 ihsv_soffset                    : 8;	//  8:15
	UINT32 ihsv_voffset                    : 8;	// 16:23
} PE_L9B0_PE1_L_CEN_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1610 pe1_l_cen_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 den_ctrl0                       : 8;	//  0: 7
	UINT32 den_apl_limit_high              : 8;	//  8:15
	UINT32 den_gain                        : 8;	// 16:23
	UINT32 den_coring                      : 8;	// 24:31
} PE_L9B0_PE1_L_CEN_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1614 pe1_l_cen_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_cen_address                 : 8;	//  0: 7
	UINT32 hif_cen_ai_sel                  : 3;	//  8:10
	UINT32                                 : 1;	//    11 reserved
	UINT32 hif_cen_ai                      : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_cen_enable                  : 1;	//    15
} PE_L9B0_PE1_L_CEN_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x1618 pe1_l_cen_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_cen_y_wdata                 :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_cen_x_wdata                 :10;	// 16:25
} PE_L9B0_PE1_L_CEN_IA_DATA;

/*-----------------------------------------------------------------------------
	0x1630 pe1_l_lrcr_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32 adjust_en                       : 1;	//     1
	UINT32 protection_en                   : 1;	//     2
	UINT32 adjust_en2                      : 1;	//     3
	UINT32 r_hist_data_sel                 : 1;	//     4
	UINT32 l_hist_data_sel                 : 1;	//     5
	UINT32 r_proc_data_sel                 : 1;	//     6
	UINT32 l_proc_data_sel                 : 1;	//     7
	UINT32 ff_mode_en                      : 1;	//     8
	UINT32 ff_mode_parity                  : 1;	//     9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 r_out_data_sel                  : 1;	//    12
	UINT32 l_out_data_sel                  : 1;	//    13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 reg_lrcr_gain                   : 4;	// 16:19
	UINT32 hist_rd_en                      : 1;	//    20
	UINT32                                 : 1;	//    21 reserved
	UINT32 hist_mode                       : 2;	// 22:23
} PE_L9B0_PE1_L_LRCR_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1634 pe1_l_lrcr_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 th_max_hist                     : 8;	//  0: 7
	UINT32 th_valid_bins                   : 8;	//  8:15
	UINT32 th1                             : 8;	// 16:23
	UINT32 th0                             : 8;	// 24:31
} PE_L9B0_PE1_L_LRCR_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1638 pe1_l_lrcr_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 2;	// 12:13 reserved
	UINT32 hist_l_window_h_bbd             : 1;	//    14
	UINT32 hist_l_window_h_en              : 1;	//    15
	UINT32 y0                              :12;	// 16:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 hist_l_window_v_bbd             : 1;	//    30
	UINT32 hist_l_window_v_en              : 1;	//    31
} PE_L9B0_PE1_L_LRCR_CTRL_02;

/*-----------------------------------------------------------------------------
	0x163c pe1_l_lrcr_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_L_LRCR_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1640 pe1_l_lrcr_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 2;	// 12:13 reserved
	UINT32 hist_r_window_h_bbd             : 1;	//    14
	UINT32 hist_r_window_h_en              : 1;	//    15
	UINT32 y0                              :12;	// 16:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 hist_r_window_v_bbd             : 1;	//    30
	UINT32 hist_r_window_v_en              : 1;	//    31
} PE_L9B0_PE1_L_LRCR_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1644 pe1_l_lrcr_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_L_LRCR_CTRL_05;

/*-----------------------------------------------------------------------------
	0x1648 pe1_l_lrcr_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 2;	// 12:13 reserved
	UINT32 active_window_h_bbd             : 1;	//    14
	UINT32 active_window_h_en              : 1;	//    15
	UINT32 y0                              :12;	// 16:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 active_window_v_bbd             : 1;	//    30
	UINT32 active_window_v_en              : 1;	//    31
} PE_L9B0_PE1_L_LRCR_CTRL_06;

/*-----------------------------------------------------------------------------
	0x164c pe1_l_lrcr_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_L_LRCR_CTRL_07;

/*-----------------------------------------------------------------------------
	0x1650 pe1_l_lrcr_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                        : 8;	//  0: 7
	UINT32 n_valid_bins                    : 8;	//  8:15
	UINT32 cdf_x1                          : 8;	// 16:23
	UINT32 cdf_x0                          : 8;	// 24:31
} PE_L9B0_PE1_L_LRCR_STAT_00;

/*-----------------------------------------------------------------------------
	0x1654 pe1_l_lrcr_stat_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                        : 8;	//  0: 7
	UINT32 n_valid_bins                    : 8;	//  8:15
	UINT32 cdf_x1                          : 8;	// 16:23
	UINT32 cdf_x0                          : 8;	// 24:31
} PE_L9B0_PE1_L_LRCR_STAT_01;

/*-----------------------------------------------------------------------------
	0x1658 pe1_l_lrcr_stat_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                        : 8;	//  0: 7
	UINT32 n_valid_bins                    : 8;	//  8:15
	UINT32 cdf_x1                          : 8;	// 16:23
	UINT32 cdf_x0                          : 8;	// 24:31
} PE_L9B0_PE1_L_LRCR_STAT_02;

/*-----------------------------------------------------------------------------
	0x1670 pe1_l_dce_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dynamic_contrast_en             : 1;	//     0
	UINT32 hist_bin_mode                   : 2;	//  1: 2
	UINT32 hist_clear                      : 1;	//     3
	UINT32                                 : 2;	//  4: 5 reserved
	UINT32 window_mode_en                  : 1;	//     6
	UINT32 window_acquire                  : 1;	//     7
	UINT32 color_region0_sel               : 1;	//     8
	UINT32 color_region1_sel               : 1;	//     9
	UINT32 color_region2_sel               : 1;	//    10
	UINT32 color_region3_sel               : 1;	//    11
	UINT32 color_region4_sel               : 1;	//    12
	UINT32 color_region5_sel               : 1;	//    13
	UINT32 color_region6_sel               : 1;	//    14
	UINT32 color_region7_sel               : 1;	//    15
	UINT32 color_region8_sel               : 1;	//    16
	UINT32 color_region9_sel               : 1;	//    17
	UINT32 color_region10_sel              : 1;	//    18
	UINT32 color_region11_sel              : 1;	//    19
	UINT32 color_region12_sel              : 1;	//    20
	UINT32 color_region13_sel              : 1;	//    21
	UINT32 color_region14_sel              : 1;	//    22
	UINT32 color_region15_sel              : 1;	//    23
	UINT32 dce_domain_sel                  : 1;	//    24
	UINT32 win_selection                   : 1;	//    25
	UINT32                                 : 2;	// 26:27 reserved
	UINT32 histogram_mode                  : 2;	// 28:29
} PE_L9B0_PE1_L_DCE_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1674 pe1_l_dce_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hist_bin_min_position           : 8;	//  0: 7
	UINT32 hist_bin_max_position           : 8;	//  8:15
	UINT32 color_region_gain               : 8;	// 16:23
} PE_L9B0_PE1_L_DCE_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1678 pe1_l_dce_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 color_region_en                 : 1;	//     0
	UINT32 color_debug_en                  : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 y_grad_gain                     : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 cb_grad_gain                    : 2;	//  8: 9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 cr_grad_gain                    : 2;	// 12:13
} PE_L9B0_PE1_L_DCE_CTRL_02;

/*-----------------------------------------------------------------------------
	0x167c pe1_l_dce_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 y_range_min                     :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 y_range_max                     :10;	// 16:25
} PE_L9B0_PE1_L_DCE_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1680 pe1_l_dce_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 cb_range_min                    :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 cb_range_max                    :10;	// 16:25
} PE_L9B0_PE1_L_DCE_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1684 pe1_l_dce_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 cr_range_min                    :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 cr_range_max                    :10;	// 16:25
} PE_L9B0_PE1_L_DCE_CTRL_05;

/*-----------------------------------------------------------------------------
	0x1688 pe1_l_dce_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_address                 : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 hif_dce_load                    : 1;	//     8
	UINT32                                 : 3;	//  9:11 reserved
	UINT32 hif_dce_ai                      : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_dce_enable                  : 1;	//    15
} PE_L9B0_PE1_L_DCE_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x168c pe1_l_dce_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_wdata_y                 :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dyc_wdata_x                 :10;	// 16:25
} PE_L9B0_PE1_L_DCE_IA_DATA;

/*-----------------------------------------------------------------------------
	0x1690 pe1_l_dce_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_wdata_y_32nd            :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dyc_wdata_x_32nd            :10;	// 16:25
} PE_L9B0_PE1_L_DCE_CTRL_08;

/*-----------------------------------------------------------------------------
	0x16a0 pe1_l_dce_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 5;	//  0: 4
	UINT32                                 : 7;	//  5:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32 hif_status_address              : 3;	// 16:18
	UINT32                                 : 9;	// 19:27 reserved
	UINT32 hif_status_ai                   : 1;	//    28
	UINT32 hif_mask                        : 1;	//    29
} PE_L9B0_PE1_L_DCE_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x16a4 pe1_l_dce_hist_ia_data1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x16a8 pe1_l_dce_hsit_ia_data2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x16ac pe1_l_dse_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dynamic_saturation_en           : 1;	//     0
	UINT32 window_mode_en                  : 1;	//     1
	UINT32 window_acquire                  : 1;	//     2
	UINT32 win_selection                   : 1;	//     3
	UINT32                                 : 4;	//  4: 7 reserved
	UINT32 color_region0_sel               : 1;	//     8
	UINT32 color_region1_sel               : 1;	//     9
	UINT32 color_region2_sel               : 1;	//    10
	UINT32 color_region3_sel               : 1;	//    11
	UINT32 color_region4_sel               : 1;	//    12
	UINT32 color_region5_sel               : 1;	//    13
	UINT32 color_region6_sel               : 1;	//    14
	UINT32 color_region7_sel               : 1;	//    15
	UINT32 color_region8_sel               : 1;	//    16
	UINT32 color_region9_sel               : 1;	//    17
	UINT32 color_region10_sel              : 1;	//    18
	UINT32 color_region11_sel              : 1;	//    19
	UINT32 color_region12_sel              : 1;	//    20
	UINT32 color_region13_sel              : 1;	//    21
	UINT32 color_region14_sel              : 1;	//    22
	UINT32 color_region15_sel              : 1;	//    23
} PE_L9B0_PE1_L_DSE_CTRL_00;

/*-----------------------------------------------------------------------------
	0x16b0 pe1_l_dse_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 :24;	//  0:23 reserved
	UINT32 color_region_gain               : 8;	// 24:31
} PE_L9B0_PE1_L_DSE_CTRL_01;

/*-----------------------------------------------------------------------------
	0x16b4 pe1_l_dse_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_wdata_y_32nd            :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dse_wdata_x_32nd            :10;	// 16:25
} PE_L9B0_PE1_L_DSE_CTRL_02;

/*-----------------------------------------------------------------------------
	0x16b8 pe1_l_dse_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_address                 : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 hif_dse_load                    : 1;	//     8
	UINT32                                 : 3;	//  9:11 reserved
	UINT32 hif_dse_ai                      : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_dse_enable                  : 1;	//    15
} PE_L9B0_PE1_L_DSE_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x16bc pe1_l_dse_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_wdata_y                 :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dse_wdata_x                 :10;	// 16:25
} PE_L9B0_PE1_L_DSE_IA_DATA;

/*-----------------------------------------------------------------------------
	0x16c0 pe1_l_wb_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 wb_en                           : 1;	//     0
	UINT32                                 :29;	//  1:29 reserved
	UINT32 gamma_en                        : 1;	//    30
	UINT32 degamma_en                      : 1;	//    31
} PE_L9B0_PE1_L_WB_CTRL_00;

/*-----------------------------------------------------------------------------
	0x16c4 pe1_l_wb_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 user_ctrl_g_gain                : 8;	//  0: 7
	UINT32 user_ctrl_b_gain                : 8;	//  8:15
	UINT32 user_ctrl_r_gain                : 8;	// 16:23
} PE_L9B0_PE1_L_WB_CTRL_01;

/*-----------------------------------------------------------------------------
	0x16c8 pe1_l_wb_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 user_ctrl_g_offset              : 8;	//  0: 7
	UINT32 user_ctrl_b_offset              : 8;	//  8:15
	UINT32 user_ctrl_r_offset              : 8;	// 16:23
} PE_L9B0_PE1_L_WB_CTRL_02;

/*-----------------------------------------------------------------------------
	0x16f0 pe1_l_gmc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_xpos                    :11;	//  0:10
	UINT32                                 : 1;	//    11 reserved
	UINT32 lut_wmask_g                     : 1;	//    12
	UINT32 lut_wmask_b                     : 1;	//    13
	UINT32 lut_wmask_r                     : 1;	//    14
	UINT32 pxl_rep_area                    : 1;	//    15
	UINT32 pxl_rep_ypos                    :12;	// 16:27
	UINT32 pxl_rep_disable_g               : 1;	//    28
	UINT32 pxl_rep_disable_b               : 1;	//    29
	UINT32 pxl_rep_disable_r               : 1;	//    30
	UINT32 pxl_rep_enable                  : 1;	//    31
} PE_L9B0_PE1_L_GMC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x16f4 pe1_l_gmc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_width                   :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 pxl_rep_height                  :12;	// 16:27
} PE_L9B0_PE1_L_GMC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x16f8 pe1_l_gmc_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_value_g                 :10;	//  0: 9
	UINT32 pxl_rep_value_b                 :10;	// 10:19
	UINT32 pxl_rep_value_r                 :10;	// 20:29
	UINT32 gmc_mode                        : 2;	// 30:31
} PE_L9B0_PE1_L_GMC_CTRL_02;

/*-----------------------------------------------------------------------------
	0x16fc pe1_l_gmc_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 capture_addr                    :10;	//  0: 9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 capture_ai                      : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 capture_num                     :11;	// 16:26
} PE_L9B0_PE1_L_GMC_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x1700 pe1_l_gmc_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lut_data_g                      :10;	//  0: 9
	UINT32 lut_data_b                      :10;	// 10:19
	UINT32 lut_data_r                      :10;	// 20:29
	UINT32 capture_stat_started            : 1;	//    30
	UINT32 capture_stat_ended              : 1;	//    31
} PE_L9B0_PE1_L_GMC_IA_DATA;

/*-----------------------------------------------------------------------------
	0x1704 pe1_l_gmc_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dither_en                       : 1;	//     0
	UINT32 decontour_en                    : 1;	//     1
	UINT32 dither_random_freeze_en         : 1;	//     2
	UINT32 demo_pattern_enable             : 1;	//     3
	UINT32 bit_mode                        : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 decontour_gain_r                : 8;	//  8:15
	UINT32 decontour_gain_g                : 8;	// 16:23
	UINT32 decontour_gain_b                : 8;	// 24:31
} PE_L9B0_PE1_L_GMC_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1720 pe1_l_sqm_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 outmux_debugmap                 : 4;	//  0: 3
	UINT32 iir                             : 4;	//  4: 7
	UINT32 i_score                         : 8;	//  8:15
	UINT32 v_score                         : 8;	// 16:23
	UINT32 l_score                         : 8;	// 24:31
} PE_L9B0_PE1_L_SQM_CTRL_0;

/*-----------------------------------------------------------------------------
	0x1724 pe1_l_sqm_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 v_limit                         : 8;	//  0: 7
	UINT32 l_limit                         : 8;	//  8:15
	UINT32 score_threshold                 : 8;	// 16:23
	UINT32 flat_threshold                  : 8;	// 24:31
} PE_L9B0_PE1_L_SQM_CTRL_1;

/*-----------------------------------------------------------------------------
	0x1728 pe1_l_sqm_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_x0                          :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 win_y0                          :11;	// 16:26
} PE_L9B0_PE1_L_SQM_CTRL_2;

/*-----------------------------------------------------------------------------
	0x172c pe1_l_sqm_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_x1                          :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 win_y1                          :11;	// 16:26
} PE_L9B0_PE1_L_SQM_CTRL_3;

/*-----------------------------------------------------------------------------
	0x1730 pe1_l_sqm_ctrl_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 charcter_delta_limit            : 8;	//  0: 7
	UINT32 boundary_width                  : 8;	//  8:15
	UINT32 video_height                    : 8;	// 16:23
} PE_L9B0_PE1_L_SQM_CTRL_4;

/*-----------------------------------------------------------------------------
	0x1734 pe1_l_sqm_ctrl_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pc_threshold                    : 8;	//  0: 7
	UINT32 pc_delta_limit                  : 8;	//  8:15
	UINT32 pc_pixel_minimal_limit          : 8;	// 16:23
} PE_L9B0_PE1_L_SQM_CTRL_5;

/*-----------------------------------------------------------------------------
	0x1738 pe1_l_sqm_stat ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1750 pe1_l_bbd2d_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 black_boundary_detection_enable : 1;	//     0
	UINT32 hysterisis_mode                 : 3;	//  1: 3
	UINT32                                 : 3;	//  4: 6 reserved
	UINT32 mode_selection                  : 1;	//     7
	UINT32 cnt_th                          : 8;	//  8:15
	UINT32 diff_th                         : 8;	// 16:23
	UINT32 vcnt                            : 8;	// 24:31
} PE_L9B0_PE1_L_BBD2D_CTRL_0;

/*-----------------------------------------------------------------------------
	0x1754 pe1_l_bbd2d_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x0                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y0                          :12;	// 16:27
} PE_L9B0_PE1_L_BBD2D_CTRL_1;

/*-----------------------------------------------------------------------------
	0x1758 pe1_l_bbd2d_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x1                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y1                          :12;	// 16:27
} PE_L9B0_PE1_L_BBD2D_CTRL_2;

/*-----------------------------------------------------------------------------
	0x175c pe1_l_bbd2d_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y0                              :12;	// 16:27
} PE_L9B0_PE1_L_BBD2D_STAT_0;

/*-----------------------------------------------------------------------------
	0x1760 pe1_l_bbd2d_stat_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_L_BBD2D_STAT_1;

/*-----------------------------------------------------------------------------
	0x1770 pe1_l_bbd3d_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 black_boundary_detection_enable : 1;	//     0
	UINT32 hysterisis_mode                 : 3;	//  1: 3
	UINT32                                 : 3;	//  4: 6 reserved
	UINT32 mode_selection                  : 1;	//     7
	UINT32 cnt_th                          : 8;	//  8:15
	UINT32 diff_th                         : 8;	// 16:23
	UINT32 vcnt                            : 8;	// 24:31
} PE_L9B0_PE1_L_BBD3D_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1774 pe1_l_bbd3d_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x0                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y0                          :12;	// 16:27
	UINT32 bbd_read_control                : 2;	// 28:29
} PE_L9B0_PE1_L_BBD3D_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1778 pe1_l_bbd3d_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x1                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y1                          :12;	// 16:27
} PE_L9B0_PE1_L_BBD3D_CTRL_02;

/*-----------------------------------------------------------------------------
	0x177c pe1_l_bbd3d_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x                               :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y                               :12;	// 16:27
} PE_L9B0_PE1_L_BBD3D_STAT_0;

/*-----------------------------------------------------------------------------
	0x1790 pe1_wcp_ctrl_00 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1794 pe1_wcp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_color_nact_cr               : 4;	//  0: 3
	UINT32 win_color_nact_cb               : 4;	//  4: 7
	UINT32 win_color_nact_yy               : 8;	//  8:15
	UINT32 win_color_dark_cr               : 4;	// 16:19
	UINT32 win_color_dark_cb               : 4;	// 20:23
	UINT32 win_color_dark_yy               : 8;	// 24:31
} PE_L9B0_PE1_WCP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1798 pe1_wcp_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 w0_blend_alpha                  : 8;	//  0: 7
	UINT32 w1_blend_alpha                  : 8;	//  8:15
	UINT32                                 : 8;	// 16:23 reserved
	UINT32 w0_blend_en                     : 2;	// 24:25
	UINT32 w1_blend_en                     : 2;	// 26:27
} PE_L9B0_PE1_WCP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x179c pe1_wcp_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 w0_imux_ctrl                    : 1;	//     0
	UINT32                                 : 1;	//     1 reserved
	UINT32 w0_dark_en                      : 1;	//     2
	UINT32                                 : 1;	//     3 reserved
	UINT32 w1_imux_ctrl                    : 1;	//     4
	UINT32                                 : 1;	//     5 reserved
	UINT32 w1_dark_en                      : 1;	//     6
	UINT32                                 : 9;	//  7:15 reserved
	UINT32 osync_mux                       : 3;	// 16:18
} PE_L9B0_PE1_WCP_CTRL_03;

/*-----------------------------------------------------------------------------
	0x17a0 pe1_wcp_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 palpha_en                       : 1;	//     0
	UINT32 palpha__reverse                 : 1;	//     1
	UINT32 palpha_clip_mode                : 2;	//  2: 3
	UINT32 ckey_en                         : 1;	//     4
	UINT32 ckey_mode                       : 1;	//     5
	UINT32 cc_reverse                      : 1;	//     6
	UINT32 yy_reverse                      : 1;	//     7
	UINT32                                 : 8;	//  8:15 reserved
	UINT32 ckey_th_yy1                     : 8;	// 16:23
	UINT32 ckey_th_yy0                     : 8;	// 24:31
} PE_L9B0_PE1_WCP_CTRL_04;

/*-----------------------------------------------------------------------------
	0x17a4 pe1_wcp_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ckey_th_cr1                     : 8;	//  0: 7
	UINT32 ckey_th_cr0                     : 8;	//  8:15
	UINT32 ckey_th_cb1                     : 8;	// 16:23
	UINT32 ckey_th_cb0                     : 8;	// 24:31
} PE_L9B0_PE1_WCP_CTRL_05;

/*-----------------------------------------------------------------------------
	0x17a8 pe1_wcp_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 cc_reverse_th_yy1               : 4;	//  0: 3
	UINT32 cc_reverse_th_yy0               : 4;	//  4: 7
	UINT32                                 : 6;	//  8:13 reserved
	UINT32 cc_reverse_mode                 : 2;	// 14:15
	UINT32 yy_reverse_th_cr                : 4;	// 16:19
	UINT32 yy_reverse_th_cb                : 4;	// 20:23
	UINT32                                 : 6;	// 24:29 reserved
	UINT32 yy_reverse_mode                 : 2;	// 30:31
} PE_L9B0_PE1_WCP_CTRL_06;

/*-----------------------------------------------------------------------------
	0x17b0 pe1_l_g_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 8;	//  0: 7
	UINT32                                 : 4;	//  8:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32                                 :12;	// 16:27 reserved
	UINT32 hist_rd_g_available             : 1;	//    28
} PE_L9B0_PE1_L_G_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x17b4 pe1_l_g_hist_ia_data ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x17b8 pe1_l_b_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 8;	//  0: 7
	UINT32                                 : 4;	//  8:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32                                 :12;	// 16:27 reserved
	UINT32 hist_rd_b_available             : 1;	//    28
} PE_L9B0_PE1_L_B_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x17bc pe1_l_b_hist_ia_data ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x17c0 pe1_l_r_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 8;	//  0: 7
	UINT32                                 : 4;	//  8:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32                                 :12;	// 16:27 reserved
	UINT32 hist_rd_r_available             : 1;	//    28
} PE_L9B0_PE1_L_R_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x17c4 pe1_l_r_hist_ia_data ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x17c8 pe1_r_g_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 8;	//  0: 7
	UINT32                                 : 4;	//  8:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32                                 :12;	// 16:27 reserved
	UINT32 hist_rd_g_available             : 1;	//    28
} PE_L9B0_PE1_R_G_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x17cc pe1_r_g_hist_ia_data ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x17d0 pe1_r_b_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 8;	//  0: 7
	UINT32                                 : 4;	//  8:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32                                 :12;	// 16:27 reserved
	UINT32 hist_rd_b_available             : 1;	//    28
} PE_L9B0_PE1_R_B_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x17d4 pe1_r_b_hist_ia_data ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x17d8 pe1_r_r_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 8;	//  0: 7
	UINT32                                 : 4;	//  8:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32                                 :12;	// 16:27 reserved
	UINT32 hist_rd_r_available             : 1;	//    28
	UINT32                                 : 2;	// 29:30 reserved
	UINT32 hist_rd_done                    : 1;	//    31
} PE_L9B0_PE1_R_R_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x17dc pe1_r_r_hist_ia_data ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3300 pe1_r_top_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 load_time                       : 1;	//     0
	UINT32 load_enable                     : 1;	//     1
	UINT32 load_type                       : 1;	//     2
} PE_L9B0_PE1_R_TOP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3304 pe1_r_top_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 width                           :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 height                          :12;	// 16:27
} PE_L9B0_PE1_R_TOP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3308 pe1_r_top_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tpg_positon                     : 1;	//     0
	UINT32 chroma_sel                      : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 disp_active_mux                 : 1;	//     4
	UINT32 async_delay_mode                : 1;	//     5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 vdpulse_pos                     :11;	//  8:18
} PE_L9B0_PE1_R_TOP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x330c pe1_r_top_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 vcnt                            :12;	//  0:11
	UINT32 va_pe1_in                       : 1;	//    12
	UINT32 va_pe1_out                      : 1;	//    13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 stat_tpg                        : 1;	//    16
	UINT32 stat_gt                         : 3;	// 17:19
	UINT32 stat_crg_lsr                    : 3;	// 20:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 stat_crg_shp                    : 3;	// 24:26
	UINT32 stat_dce                        : 1;	//    27
	UINT32 stat_cen                        : 1;	//    28
	UINT32 stat_wb                         : 1;	//    29
	UINT32 stat_gmc                        : 2;	// 30:31
} PE_L9B0_PE1_R_TOP_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3320 pe1_r_win1_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 6;	//  0: 5 reserved
	UINT32 win_outside                     : 1;	//     6
	UINT32 win_en                          : 1;	//     7
	UINT32 bdr_alpha                       : 5;	//  8:12
	UINT32 bdr_wid                         : 2;	// 13:14
	UINT32 bdr_en                          : 1;	//    15
	UINT32 cr5                             : 5;	// 16:20
	UINT32 cb5                             : 5;	// 21:25
	UINT32 yy6                             : 6;	// 26:31
} PE_L9B0_PE1_R_WIN1_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3324 pe1_r_win1_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y0                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN1_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3328 pe1_r_win1_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y1                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN1_CTRL_02;

/*-----------------------------------------------------------------------------
	0x332c pe1_r_win1_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y0                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN1_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3330 pe1_r_win1_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y1                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN1_CTRL_04;

/*-----------------------------------------------------------------------------
	0x3334 pe1_r_win2_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 6;	//  0: 5 reserved
	UINT32 win_outside                     : 1;	//     6
	UINT32 win_en                          : 1;	//     7
	UINT32 bdr_alpha                       : 5;	//  8:12
	UINT32 bdr_wid                         : 2;	// 13:14
	UINT32 bdr_en                          : 1;	//    15
	UINT32 cr5                             : 5;	// 16:20
	UINT32 cb5                             : 5;	// 21:25
	UINT32 yy6                             : 6;	// 26:31
} PE_L9B0_PE1_R_WIN2_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3338 pe1_r_win2_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y0                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN2_CTRL_01;

/*-----------------------------------------------------------------------------
	0x333c pe1_r_win2_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y1                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN2_CTRL_02;

/*-----------------------------------------------------------------------------
	0x3340 pe1_r_win2_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y0                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN2_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3344 pe1_r_win2_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y1                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN2_CTRL_04;

/*-----------------------------------------------------------------------------
	0x3350 pe1_r_apl_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_win_ctrl_x0                 :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 apl_win_ctrl_y0                 :12;	// 16:27
} PE_L9B0_PE1_R_APL_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3354 pe1_r_apl_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_win_ctrl_x1                 :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 apl_win_ctrl_y1                 :12;	// 16:27
} PE_L9B0_PE1_R_APL_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3358 pe1_r_apl_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_position                    : 2;	//  0: 1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 apl_y_type                      : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 act_win_mode                    : 1;	//     8
} PE_L9B0_PE1_R_APL_CTRL_02;

/*-----------------------------------------------------------------------------
	0x335c pe1_r_apl_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_y                           :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 apl_rgb                         :10;	// 16:25
} PE_L9B0_PE1_R_APL_STAT_00;

/*-----------------------------------------------------------------------------
	0x3360 pe1_r_apl_stat_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_b                           :10;	//  0: 9
	UINT32 apl_g                           :10;	// 10:19
	UINT32 apl_r                           :10;	// 20:29
} PE_L9B0_PE1_R_APL_STAT_01;

/*-----------------------------------------------------------------------------
	0x3364 pe1_r_apl_stat_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_y__other_side               :10;	//  0: 9
} PE_L9B0_PE1_R_APL_STAT_02;

/*-----------------------------------------------------------------------------
	0x3368 pe1_r_apl_stat_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 apl_b__other_side               :10;	//  0: 9
	UINT32 apl_g__other_side               :10;	// 10:19
	UINT32 apl_r__other_side               :10;	// 20:29
} PE_L9B0_PE1_R_APL_STAT_03;

/*-----------------------------------------------------------------------------
	0x33a0 pe1_r_film_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 vignetting_enable               : 1;	//     0
	UINT32 film_contrast_enable            : 1;	//     1
	UINT32                                 : 6;	//  2: 7 reserved
	UINT32 contrast_alpha                  : 8;	//  8:15
	UINT32 contrast_delta_max              : 8;	// 16:23
	UINT32 vignetting_gain                 : 8;	// 24:31
} PE_L9B0_PE1_R_FILM_CTRL_00;

/*-----------------------------------------------------------------------------
	0x33a4 pe1_r_film_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 noise_gen_enable                : 1;	//     0
	UINT32 noise_frame_rate                : 3;	//  1: 3
	UINT32 noise_size                      : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 noise_gain                      : 8;	//  8:15
} PE_L9B0_PE1_R_FILM_CTRL_01;

/*-----------------------------------------------------------------------------
	0x33a8 pe1_r_film_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tone_gain                       : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 tone_offset                     : 6;	//  8:13
} PE_L9B0_PE1_R_FILM_CTRL_02;

/*-----------------------------------------------------------------------------
	0x33b0 pe1_r_win3_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 6;	//  0: 5 reserved
	UINT32 win_outside                     : 1;	//     6
	UINT32 win_en                          : 1;	//     7
	UINT32 bdr_alpha                       : 5;	//  8:12
	UINT32 bdr_wid                         : 2;	// 13:14
	UINT32 bdr_en                          : 1;	//    15
	UINT32 cr5                             : 5;	// 16:20
	UINT32 cb5                             : 5;	// 21:25
	UINT32 yy6                             : 6;	// 26:31
} PE_L9B0_PE1_R_WIN3_CTRL_00;

/*-----------------------------------------------------------------------------
	0x33b4 pe1_r_win3_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y0                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN3_CTRL_01;

/*-----------------------------------------------------------------------------
	0x33b8 pe1_r_win3_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w0_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w0_y1                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN3_CTRL_02;

/*-----------------------------------------------------------------------------
	0x33bc pe1_r_win3_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x0                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y0                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN3_CTRL_03;

/*-----------------------------------------------------------------------------
	0x33c0 pe1_r_win3_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_w1_x1                       :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 win_w1_y1                       :12;	// 16:27
} PE_L9B0_PE1_R_WIN3_CTRL_04;

/*-----------------------------------------------------------------------------
	0x33d0 pe1_r_derh_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 vsum_mode                       : 2;	//  0: 1
	UINT32 hsum_mode                       : 2;	//  2: 3
	UINT32 vsum121_en                      : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 vertical_min_max                : 2;	//  8: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 a_flt_mux                       : 2;	// 16:17
	UINT32 a_e_mux                         : 2;	// 18:19
	UINT32 t_mux                           : 1;	//    20
	UINT32                                 : 3;	// 21:23 reserved
	UINT32 a_gen_width                     : 4;	// 24:27
} PE_L9B0_PE1_R_DERH_CTRL_00;

/*-----------------------------------------------------------------------------
	0x33d4 pe1_r_derh_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 a_gen_of_y                      : 8;	//  0: 7
	UINT32 a_gen_of_c                      : 8;	//  8:15
	UINT32 avg_flt_mode                    : 3;	// 16:18
	UINT32 avg_flt_en                      : 1;	//    19
	UINT32                                 : 4;	// 20:23 reserved
	UINT32 max_flt_mode                    : 3;	// 24:26
} PE_L9B0_PE1_R_DERH_CTRL_01;

/*-----------------------------------------------------------------------------
	0x33d8 pe1_r_derh_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 a_exp_gain_ctrl_y0              : 4;	//  0: 3
	UINT32 a_exp2_gain_ctrl_x0             : 4;	//  4: 7
	UINT32 a_exp2_gain_ctrl_y1             : 4;	//  8:11
	UINT32 a_exp2_gain_ctrl_x1             : 4;	// 12:15
	UINT32 a_avg2_flt_wid                  : 4;	// 16:19
	UINT32 a_avg2_flt_en                   : 1;	//    20
	UINT32                                 : 3;	// 21:23 reserved
	UINT32 a_exp_max2_en                   : 1;	//    24
	UINT32                                 : 1;	//    25 reserved
	UINT32 y_sum_mode                      : 2;	// 26:27
} PE_L9B0_PE1_R_DERH_CTRL_02;

/*-----------------------------------------------------------------------------
	0x33dc pe1_r_derh_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 5;	//  0: 4 reserved
	UINT32 a_mux_for_edge_gaintable        : 3;	//  5: 7
	UINT32                                 : 9;	//  8:16 reserved
	UINT32 a_mux_for_detail_filter         : 3;	// 17:19
	UINT32                                 : 1;	//    20 reserved
	UINT32 a_mux_for_edge_filter           : 3;	// 21:23
	UINT32 a_scaling_flat_filter           : 4;	// 24:27
	UINT32                                 : 1;	//    28 reserved
	UINT32 a_mux_for_flat_filter           : 3;	// 29:31
} PE_L9B0_PE1_R_DERH_CTRL_03;

/*-----------------------------------------------------------------------------
	0x33e0 pe1_r_derh_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 1;	//     0 reserved
	UINT32 reg_dbg_scale                   : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 sum_mux                         : 4;	//  4: 7
	UINT32 reg_enh_en_cc                   : 3;	//  8:10
	UINT32                                 : 1;	//    11 reserved
	UINT32 reg_enh_en_yy                   : 3;	// 12:14
} PE_L9B0_PE1_R_DERH_CTRL_04;

/*-----------------------------------------------------------------------------
	0x33e4 pe1_r_derh_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 reg_vmm_param                   : 2;	//  0: 1
	UINT32                                 : 6;	//  2: 7 reserved
	UINT32 reg_csft_gain                   : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 reg_th_gain_edge                : 6;	// 16:21
	UINT32 reg_th_gain_flat                : 2;	// 22:23
	UINT32 reg_th_manual_th                : 7;	// 24:30
	UINT32 reg_th_manual_en                : 1;	//    31
} PE_L9B0_PE1_R_DERH_CTRL_05;

/*-----------------------------------------------------------------------------
	0x33e8 pe1_r_derh_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 edge_filter_white_gain          : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 edge_filter_black_gain          : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 reg_amean_en                    : 1;	//    24
	UINT32                                 : 1;	//    25 reserved
	UINT32 edge_filter_v_tap               : 2;	// 26:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 edge_c_filter_en                : 1;	//    30
	UINT32 edge_y_filter_en                : 1;	//    31
} PE_L9B0_PE1_R_DERH_CTRL_06;

/*-----------------------------------------------------------------------------
	0x33ec pe1_r_derh_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 :24;	//  0:23 reserved
	UINT32 flat_filter_gain                : 6;	// 24:29
	UINT32                                 : 1;	//    30 reserved
	UINT32 flat_filter_en                  : 1;	//    31
} PE_L9B0_PE1_R_DERH_CTRL_07;

/*-----------------------------------------------------------------------------
	0x33f0 pe1_r_derh_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 amod_ctrl0_y0                   : 8;	//  0: 7
	UINT32 amod_ctrl0_x0                   : 8;	//  8:15
	UINT32 amod_ctrl0_y1                   : 8;	// 16:23
	UINT32 amod_ctrl0_x1                   : 8;	// 24:31
} PE_L9B0_PE1_R_DERH_CTRL_08;

/*-----------------------------------------------------------------------------
	0x33f4 pe1_r_derh_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 amod_ctrl1_x0                   : 8;	//  0: 7
	UINT32 amod_ctrl1_x1                   : 8;	//  8:15
	UINT32 y_c_mux_control                 : 3;	// 16:18
	UINT32 chroma_weight                   : 5;	// 19:23
} PE_L9B0_PE1_R_DERH_CTRL_09;

/*-----------------------------------------------------------------------------
	0x3400 pe1_r_derv_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 der_v_en                        : 1;	//     0
	UINT32 der_gain_mapping                : 2;	//  1: 2
	UINT32 bif_en                          : 1;	//     3
	UINT32 output_mux                      : 4;	//  4: 7
	UINT32 bif_manual_th                   : 8;	//  8:15
	UINT32 th_gain                         : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 th_mode                         : 1;	//    24
} PE_L9B0_PE1_R_DERV_CTRL_0;

/*-----------------------------------------------------------------------------
	0x3404 pe1_r_derv_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 csft_gain                       : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 csft_mode                       : 1;	//     8
} PE_L9B0_PE1_R_DERV_CTRL_1;

/*-----------------------------------------------------------------------------
	0x3408 pe1_r_derv_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 mmd_sel                         : 3;	//  0: 2
	UINT32                                 : 1;	//     3 reserved
	UINT32 max_sel                         : 3;	//  4: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 avg_sel                         : 2;	//  8: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 gain_th1                        : 8;	// 16:23
	UINT32 gain_th2                        : 8;	// 24:31
} PE_L9B0_PE1_R_DERV_CTRL_2;

/*-----------------------------------------------------------------------------
	0x340c pe1_r_derv_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gain_b                          : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 gain_w                          : 7;	//  8:14
} PE_L9B0_PE1_R_DERV_CTRL_3;

/*-----------------------------------------------------------------------------
	0x3410 pe1_r_dp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pe1_r_dp_ctrl_00                : 3;	//  0: 2
} PE_L9B0_PE1_R_DP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3414 pe1_r_dp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_gain_b                     : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 edge_gain_w                     : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 texture_gain_b                  : 7;	// 16:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 texture_gain_w                  : 7;	// 24:30
} PE_L9B0_PE1_R_DP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3418 pe1_r_dp_ctrl_02 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x341c pe1_r_dp_ctrl_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3420 pe1_r_coring_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tm_h                            :16;	//  0:15
	UINT32 tm_v                            :16;	// 16:31
} PE_L9B0_PE1_R_CORING_STAT_00;

/*-----------------------------------------------------------------------------
	0x3424 pe1_r_coring_stat_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 tm_h                            :16;	//  0:15
} PE_L9B0_PE1_R_CORING_STAT_01;

/*-----------------------------------------------------------------------------
	0x3428 pe1_r_coring_stat_02 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x342c pe1_r_coring_stat_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3470 pe1_r_derh_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 a2g_mode_e                      : 1;	//     0
	UINT32 a2g_mode_f                      : 1;	//     1
	UINT32                                 : 6;	//  2: 7 reserved
	UINT32 a2g_mgain_e                     : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 a2g_mgain_f                     : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 debug_mode                      : 4;	// 24:27
} PE_L9B0_PE1_R_DERH_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x3474 pe1_r_derh_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 e_gain_th1                      : 8;	//  0: 7
	UINT32 e_gain_th2                      : 8;	//  8:15
	UINT32 f_gain_th1                      : 8;	// 16:23
	UINT32 f_gain_th2                      : 8;	// 24:31
} PE_L9B0_PE1_R_DERH_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x3478 pe1_r_derh_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 e_gain_max                      : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 f_gain_max                      : 6;	//  8:13
} PE_L9B0_PE1_R_DERH_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x347c pe1_r_derh_ctrl_0d ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3490 pe1_r_sp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_enhance_enable             : 1;	//     0
	UINT32                                 :11;	//  1:11 reserved
	UINT32 edge_operator_selection         : 2;	// 12:13
} PE_L9B0_PE1_R_SP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3494 pe1_r_sp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 white_gain                      : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 black_gain                      : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 horizontal_gain                 : 8;	// 16:23
	UINT32 vertical_gain                   : 8;	// 24:31
} PE_L9B0_PE1_R_SP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3498 pe1_r_sp_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 sobel_weight                    : 8;	//  0: 7
	UINT32 laplacian_weight                : 8;	//  8:15
	UINT32 sobel_manual_mode_en            : 1;	//    16
	UINT32                                 : 7;	// 17:23 reserved
	UINT32 sobel_manual_gain               : 8;	// 24:31
} PE_L9B0_PE1_R_SP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x349c pe1_r_sp_ctrl_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x34a0 pe1_r_sp_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 display_mode                    : 4;	//  8:11
	UINT32 gx_weight_manual_mode           : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 gx_weight_manual_gain           : 8;	// 16:23
} PE_L9B0_PE1_R_SP_CTRL_04;

/*-----------------------------------------------------------------------------
	0x34a8 pe1_r_sp_ctrl_05 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x34ac pe1_r_sp_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lap_h_mode                      : 2;	//  0: 1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 lap_v_mode                      : 1;	//     4
} PE_L9B0_PE1_R_SP_CTRL_06;

/*-----------------------------------------------------------------------------
	0x34b0 pe1_r_sp_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_en                           : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 gb_mode                         : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 gb_x1                           : 8;	//  8:15
	UINT32 gb_y1                           : 8;	// 16:23
} PE_L9B0_PE1_R_SP_CTRL_07;

/*-----------------------------------------------------------------------------
	0x34b4 pe1_r_sp_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_x2                           : 8;	//  0: 7
	UINT32 gb_y2                           : 8;	//  8:15
	UINT32 gb_y3                           : 8;	// 16:23
} PE_L9B0_PE1_R_SP_CTRL_08;

/*-----------------------------------------------------------------------------
	0x34b8 pe1_r_sp_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_x_l0                       : 8;	//  0: 7
	UINT32 lum1_x_l1                       : 8;	//  8:15
	UINT32 lum1_x_h0                       : 8;	// 16:23
	UINT32 lum1_x_h1                       : 8;	// 24:31
} PE_L9B0_PE1_R_SP_CTRL_09;

/*-----------------------------------------------------------------------------
	0x34bc pe1_r_sp_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_y0                         : 8;	//  0: 7
	UINT32 lum1_y1                         : 8;	//  8:15
	UINT32 lum1_y2                         : 8;	// 16:23
	UINT32 lum2_x_l0                       : 8;	// 24:31
} PE_L9B0_PE1_R_SP_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x34c0 pe1_r_sp_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_x_l1                       : 8;	//  0: 7
	UINT32 lum2_x_h0                       : 8;	//  8:15
	UINT32 lum2_x_h1                       : 8;	// 16:23
	UINT32 lum2_y0                         : 8;	// 24:31
} PE_L9B0_PE1_R_SP_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x34c4 pe1_r_sp_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_y1                         : 8;	//  0: 7
	UINT32 lum2_y2                         : 8;	//  8:15
} PE_L9B0_PE1_R_SP_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x34d0 pe1_r_debug_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable_debug_mode               : 1;	//     0
	UINT32                                 : 8;	//  1: 8 reserved
	UINT32 show_sqm2                       : 1;	//     9
	UINT32 sqm2_debug_image                : 4;	// 10:13
	UINT32                                 : 1;	//    14 reserved
	UINT32 show_bbd                        : 2;	// 15:16
	UINT32 bbd_line_width                  : 3;	// 17:19
	UINT32 show_apl                        : 1;	//    20
} PE_L9B0_PE1_R_DEBUG_CTRL_00;

/*-----------------------------------------------------------------------------
	0x34d4 pe1_r_debug_ctrl_01 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x34f0 pe1_r_mp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_enhance_enable             : 1;	//     0
	UINT32                                 :11;	//  1:11 reserved
	UINT32 edge_operator_selection         : 2;	// 12:13
} PE_L9B0_PE1_R_MP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x34f4 pe1_r_mp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 white_gain                      : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 black_gain                      : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 horizontal_gain                 : 8;	// 16:23
	UINT32 vertical_gain                   : 8;	// 24:31
} PE_L9B0_PE1_R_MP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x34f8 pe1_r_mp_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 sobel_weight                    : 8;	//  0: 7
	UINT32 laplacian_weight                : 8;	//  8:15
	UINT32 sobel_manual_mode_en            : 1;	//    16
	UINT32                                 : 7;	// 17:23 reserved
	UINT32 sobel_manual_gain               : 8;	// 24:31
} PE_L9B0_PE1_R_MP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x34fc pe1_r_mp_ctrl_03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3500 pe1_r_mp_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 display_mode                    : 4;	//  8:11
	UINT32 gx_weight_manual_mode           : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 gx_weight_manual_gain           : 8;	// 16:23
} PE_L9B0_PE1_R_MP_CTRL_04;

/*-----------------------------------------------------------------------------
	0x3508 pe1_r_mp_ctrl_05 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x350c pe1_r_mp_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lap_h_mode                      : 3;	//  0: 2
	UINT32                                 : 1;	//     3 reserved
	UINT32 lap_v_mode                      : 3;	//  4: 6
} PE_L9B0_PE1_R_MP_CTRL_06;

/*-----------------------------------------------------------------------------
	0x3510 pe1_r_mp_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_en                           : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 gb_mode                         : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 gb_x1                           : 8;	//  8:15
	UINT32 gb_y1                           : 8;	// 16:23
} PE_L9B0_PE1_R_MP_CTRL_07;

/*-----------------------------------------------------------------------------
	0x3514 pe1_r_mp_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gb_x2                           : 8;	//  0: 7
	UINT32 gb_y2                           : 8;	//  8:15
	UINT32 gb_y3                           : 8;	// 16:23
} PE_L9B0_PE1_R_MP_CTRL_08;

/*-----------------------------------------------------------------------------
	0x3518 pe1_r_mp_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_x_l0                       : 8;	//  0: 7
	UINT32 lum1_x_l1                       : 8;	//  8:15
	UINT32 lum1_x_h0                       : 8;	// 16:23
	UINT32 lum1_x_h1                       : 8;	// 24:31
} PE_L9B0_PE1_R_MP_CTRL_09;

/*-----------------------------------------------------------------------------
	0x351c pe1_r_mp_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum1_y0                         : 8;	//  0: 7
	UINT32 lum1_y1                         : 8;	//  8:15
	UINT32 lum1_y2                         : 8;	// 16:23
	UINT32 lum2_x_l0                       : 8;	// 24:31
} PE_L9B0_PE1_R_MP_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x3520 pe1_r_mp_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_x_l1                       : 8;	//  0: 7
	UINT32 lum2_x_h0                       : 8;	//  8:15
	UINT32 lum2_x_h1                       : 8;	// 16:23
	UINT32 lum2_y0                         : 8;	// 24:31
} PE_L9B0_PE1_R_MP_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x3524 pe1_r_mp_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lum2_y1                         : 8;	//  0: 7
	UINT32 lum2_y2                         : 8;	//  8:15
} PE_L9B0_PE1_R_MP_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x3530 pe1_r_cti_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 cti_en                          : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 tap_size                        : 3;	//  4: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 cti_gain                        : 8;	//  8:15
} PE_L9B0_PE1_R_CTI_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3534 pe1_r_cti_ctrl_01 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3538 pe1_r_cti_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ycm_en0                         : 1;	//     0
	UINT32 ycm_en1                         : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 ycm_band_sel                    : 3;	//  4: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 ycm_diff_th                     : 8;	//  8:15
	UINT32 ycm_y_gain                      : 4;	// 16:19
	UINT32 ycm_c_gain                      : 4;	// 20:23
} PE_L9B0_PE1_R_CTI_CTRL_02;

/*-----------------------------------------------------------------------------
	0x3550 pe1_r_blur_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32 coring_en                       : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 direction                       : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 gain                            : 8;	//  8:15
	UINT32 coring_min                      : 8;	// 16:23
	UINT32 coring_max                      : 8;	// 24:31
} PE_L9B0_PE1_R_BLUR_CTRL;

/*-----------------------------------------------------------------------------
	0x3560 pe1_r_coring_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ga_max                          : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 ga_th0                          : 8;	//  8:15
	UINT32 ga_th1                          : 8;	// 16:23
	UINT32 amap1_sel                       : 2;	// 24:25
	UINT32 amap2_sel                       : 2;	// 26:27
	UINT32 edge_a_sel                      : 1;	//    28
	UINT32 debug_a_sel                     : 1;	//    29
} PE_L9B0_PE1_R_CORING_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3564 pe1_r_coring_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_sel                         : 3;	//  0: 2
	UINT32                                 : 1;	//     3 reserved
	UINT32 avg_sel                         : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 a2tw_min                        : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 a2tw_th0                        : 8;	// 16:23
	UINT32 a2tw_th1                        : 8;	// 24:31
} PE_L9B0_PE1_R_CORING_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3568 pe1_r_coring_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 nrv_en                          : 1;	//     0
	UINT32                                 : 7;	//  1: 7 reserved
	UINT32 nrv_th1                         : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 nrv_th2                         : 6;	// 16:21
} PE_L9B0_PE1_R_CORING_CTRL_02;

/*-----------------------------------------------------------------------------
	0x356c pe1_r_coring_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 nrh_en                          : 1;	//     0
	UINT32                                 : 7;	//  1: 7 reserved
	UINT32 nrh_th1                         : 6;	//  8:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 nrh_th2                         : 6;	// 16:21
} PE_L9B0_PE1_R_CORING_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3570 pe1_r_coring_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dflt_sel                        : 2;	//  0: 1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 var_th                          :11;	//  4:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 coring_mode1                    : 2;	// 16:17
	UINT32 coring_mode2                    : 2;	// 18:19
	UINT32 ac_direction                    : 1;	//    20
	UINT32 tflt_en                         : 1;	//    21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 exp_mode                        : 2;	// 24:25
} PE_L9B0_PE1_R_CORING_CTRL_04;

/*-----------------------------------------------------------------------------
	0x3574 pe1_r_coring_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gt_max                          : 6;	//  0: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 gt_th0                          : 8;	//  8:15
	UINT32 gt_th1                          : 8;	// 16:23
	UINT32 a2tw_en                         : 1;	//    24
} PE_L9B0_PE1_R_CORING_CTRL_05;

/*-----------------------------------------------------------------------------
	0x3578 pe1_r_coring_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 gt_th0a                         : 8;	//  0: 7
	UINT32 gt_th0b                         : 8;	//  8:15
	UINT32 gt_gain0a                       : 6;	// 16:21
	UINT32                                 : 2;	// 22:23 reserved
	UINT32 gt_gain0b                       : 6;	// 24:29
} PE_L9B0_PE1_R_CORING_CTRL_06;

/*-----------------------------------------------------------------------------
	0x357c pe1_r_coring_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 g_th0                           : 8;	//  0: 7
	UINT32 g_th1                           : 8;	//  8:15
	UINT32 amap_gain                       : 7;	// 16:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 tmap_gain                       : 7;	// 24:30
} PE_L9B0_PE1_R_CORING_CTRL_07;

/*-----------------------------------------------------------------------------
	0x3580 pe1_r_coring_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 mp_coring_mode                  : 2;	//  0: 1
	UINT32 sp_coring_mode                  : 2;	//  2: 3
	UINT32 mp_coring_en                    : 1;	//     4
	UINT32 sp_coring_en                    : 1;	//     5
} PE_L9B0_PE1_R_CORING_CTRL_08;

/*-----------------------------------------------------------------------------
	0x3584 pe1_r_coring_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edge_gain_b                     : 7;	//  0: 6
	UINT32                                 : 1;	//     7 reserved
	UINT32 edge_gain_w                     : 7;	//  8:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 texture_gain_b                  : 7;	// 16:22
	UINT32                                 : 1;	//    23 reserved
	UINT32 texture_gain_w                  : 7;	// 24:30
} PE_L9B0_PE1_R_CORING_CTRL_09;

/*-----------------------------------------------------------------------------
	0x3590 pe1_r_dj_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edf_en                          : 1;	//     0
	UINT32 hv_filter_en                    : 1;	//     1
	UINT32 g0_feature_norm_en              : 1;	//     2
	UINT32 g0_f2g_mapping_en               : 1;	//     3
	UINT32 line_variation_mode             : 1;	//     4
	UINT32 l_type_protection               : 1;	//     5
	UINT32 center_blur_en                  : 1;	//     6
	UINT32 direction_type_mode             : 1;	//     7
	UINT32 count_diff_th                   : 5;	//  8:12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 output_mux                      : 3;	// 16:18
	UINT32                                 : 3;	// 19:21 reserved
	UINT32 n_avg_mode                      : 1;	//    22
	UINT32                                 : 1;	//    23 reserved
	UINT32 line_variation_diff__threshold  : 8;	// 24:31
} PE_L9B0_PE1_R_DJ_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3594 pe1_r_dj_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 level_th                        : 8;	//  0: 7
	UINT32 protect_th                      : 8;	//  8:15
	UINT32 n_avg_gain                      : 8;	// 16:23
} PE_L9B0_PE1_R_DJ_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3598 pe1_r_dj_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 edf_count_min                   : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 edf_count_max                   : 5;	//  8:12
} PE_L9B0_PE1_R_DJ_CTRL_02;

/*-----------------------------------------------------------------------------
	0x359c pe1_r_dj_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dj_h_count_min                  : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 dj_h_count_max                  : 5;	//  8:12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 dj_v_count_min                  : 5;	// 16:20
	UINT32                                 : 4;	// 21:24 reserved
	UINT32 dj_v_count_max                  : 4;	// 25:28
} PE_L9B0_PE1_R_DJ_CTRL_03;

/*-----------------------------------------------------------------------------
	0x35a0 pe1_r_level_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32                                 : 3;	//  1: 3 reserved
	UINT32 y_offset                        :10;	//  4:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 center_position                 : 8;	// 16:23
	UINT32 y_gain                          : 8;	// 24:31
} PE_L9B0_PE1_R_LEVEL_CTRL_00;

/*-----------------------------------------------------------------------------
	0x35a4 pe1_r_vspyc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32 graycolor_enable                : 1;	//     1
	UINT32 color_only_enable               : 1;	//     2
	UINT32 cb_info                         : 1;	//     3
	UINT32 cr_info                         : 1;	//     4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 center_position                 : 8;	//  8:15
	UINT32 contrast                        :10;	// 16:25
} PE_L9B0_PE1_R_VSPYC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x35a8 pe1_r_vspyc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 8;	//  0: 7 reserved
	UINT32 saturation                      : 8;	//  8:15
	UINT32 brightness                      :10;	// 16:25
} PE_L9B0_PE1_R_VSPYC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x35b0 pe1_r_vsprgb_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 contrast                        :10;	//  0: 9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 center_position                 : 8;	// 12:19
	UINT32 brightness                      :10;	// 20:29
	UINT32                                 : 1;	//    30 reserved
	UINT32 enable                          : 1;	//    31
} PE_L9B0_PE1_R_VSPRGB_CTRL_00;

/*-----------------------------------------------------------------------------
	0x35c0 pe1_r_xvy_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 outputcsc_en                    : 1;	//     0
	UINT32 degamma_en                      : 1;	//     1
	UINT32 pcc_en                          : 1;	//     2
	UINT32 gamma_en                        : 1;	//     3
	UINT32 scaler_en                       : 1;	//     4
	UINT32 hsv_hsl_selection               : 1;	//     5
	UINT32 s_adpative_scaler_enable        : 1;	//     6
} PE_L9B0_PE1_R_XVY_CTRL_00;

/*-----------------------------------------------------------------------------
	0x35c4 pe1_r_xvy_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef1                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef0                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_01;

/*-----------------------------------------------------------------------------
	0x35c8 pe1_r_xvy_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef3                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef2                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_02;

/*-----------------------------------------------------------------------------
	0x35cc pe1_r_xvy_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef5                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef4                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_03;

/*-----------------------------------------------------------------------------
	0x35d0 pe1_r_xvy_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_coef7                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_coef6                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_04;

/*-----------------------------------------------------------------------------
	0x35d4 pe1_r_xvy_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst0                     :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 r_csc_coef8                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_05;

/*-----------------------------------------------------------------------------
	0x35d8 pe1_r_xvy_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst2                     :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 r_csc_ofst1                     :11;	// 16:26
} PE_L9B0_PE1_R_XVY_CTRL_06;

/*-----------------------------------------------------------------------------
	0x35dc pe1_r_xvy_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_csc_ofst4                     :14;	//  0:13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 r_csc_ofst3                     :14;	// 16:29
} PE_L9B0_PE1_R_XVY_CTRL_07;

/*-----------------------------------------------------------------------------
	0x35e0 pe1_r_xvy_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef0                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_csc_ofst5                     :14;	// 16:29
} PE_L9B0_PE1_R_XVY_CTRL_08;

/*-----------------------------------------------------------------------------
	0x35e4 pe1_r_xvy_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef2                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef1                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_09;

/*-----------------------------------------------------------------------------
	0x35e8 pe1_r_xvy_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef4                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef3                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x35ec pe1_r_xvy_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef6                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef5                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x35f0 pe1_r_xvy_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 r_pcc_coef8                     :15;	//  0:14
	UINT32                                 : 1;	//    15 reserved
	UINT32 r_pcc_coef7                     :15;	// 16:30
} PE_L9B0_PE1_R_XVY_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x35f4 pe1_r_xvy_ctrl_0d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 scaler                          : 8;	//  0: 7
} PE_L9B0_PE1_R_XVY_CTRL_0D;

/*-----------------------------------------------------------------------------
	0x3600 pe1_r_cen_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 : 2;	//  0: 1 reserved
	UINT32 select_hsv                      : 1;	//     2
	UINT32 select_rgb                      : 1;	//     3
	UINT32                                 : 1;	//     4 reserved
	UINT32 vsp_sel                         : 1;	//     5
	UINT32 global_apl_sel                  : 1;	//     6
	UINT32 reg_cen_bypass                  : 1;	//     7
	UINT32 reg_cen_debug_mode              : 1;	//     8
	UINT32 debugging_mode_core             : 1;	//     9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 v_scaler_en                     : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 demo_mode                       : 8;	// 16:23
	UINT32                                 : 7;	// 24:30 reserved
	UINT32 win_control_mode                : 1;	//    31
} PE_L9B0_PE1_R_CEN_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3604 pe1_r_cen_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 show_color_region0              : 8;	//  0: 7
	UINT32 show_color_region1              : 8;	//  8:15
	UINT32                                 : 8;	// 16:23 reserved
	UINT32 color_region_en1                : 8;	// 24:31
} PE_L9B0_PE1_R_CEN_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3608 pe1_r_cen_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ihsv_sgain                      : 8;	//  0: 7
	UINT32 ihsv_vgain                      : 8;	//  8:15
} PE_L9B0_PE1_R_CEN_CTRL_02;

/*-----------------------------------------------------------------------------
	0x360c pe1_r_cen_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 ihsv_hoffset                    : 8;	//  0: 7
	UINT32 ihsv_soffset                    : 8;	//  8:15
	UINT32 ihsv_voffset                    : 8;	// 16:23
} PE_L9B0_PE1_R_CEN_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3610 pe1_r_cen_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 den_ctrl0                       : 8;	//  0: 7
	UINT32 den_apl_limit_high              : 8;	//  8:15
	UINT32 den_gain                        : 8;	// 16:23
	UINT32 den_coring                      : 8;	// 24:31
} PE_L9B0_PE1_R_CEN_CTRL_04;

/*-----------------------------------------------------------------------------
	0x3614 pe1_r_cen_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_cen_address                 : 8;	//  0: 7
	UINT32 hif_cen_ai_sel                  : 3;	//  8:10
	UINT32                                 : 1;	//    11 reserved
	UINT32 hif_cen_ai                      : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_cen_enable                  : 1;	//    15
} PE_L9B0_PE1_R_CEN_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x3618 pe1_r_cen_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_cen_y_wdata                 :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_cen_x_wdata                 :10;	// 16:25
} PE_L9B0_PE1_R_CEN_IA_DATA;

/*-----------------------------------------------------------------------------
	0x3630 pe1_r_lrcr_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 enable                          : 1;	//     0
	UINT32 adjust_en                       : 1;	//     1
	UINT32 protection_en                   : 1;	//     2
	UINT32 adjust_en2                      : 1;	//     3
	UINT32 r_hist_data_sel                 : 1;	//     4
	UINT32 l_hist_data_sel                 : 1;	//     5
	UINT32 r_proc_data_sel                 : 1;	//     6
	UINT32 l_proc_data_sel                 : 1;	//     7
	UINT32 ff_mode_en                      : 1;	//     8
	UINT32 ff_mode_parity                  : 1;	//     9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 r_out_data_sel                  : 1;	//    12
	UINT32 l_out_data_sel                  : 1;	//    13
	UINT32                                 : 2;	// 14:15 reserved
	UINT32 reg_lrcr_gain                   : 4;	// 16:19
	UINT32 hist_rd_en                      : 1;	//    20
	UINT32                                 : 1;	//    21 reserved
	UINT32 hist_mode                       : 2;	// 22:23
} PE_L9B0_PE1_R_LRCR_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3634 pe1_r_lrcr_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 th_max_hist                     : 8;	//  0: 7
	UINT32 th_valid_bins                   : 8;	//  8:15
	UINT32 th1                             : 8;	// 16:23
	UINT32 th0                             : 8;	// 24:31
} PE_L9B0_PE1_R_LRCR_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3638 pe1_r_lrcr_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 2;	// 12:13 reserved
	UINT32 hist_l_window_h_bbd             : 1;	//    14
	UINT32 hist_l_window_h_en              : 1;	//    15
	UINT32 y0                              :12;	// 16:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 hist_l_window_v_bbd             : 1;	//    30
	UINT32 hist_l_window_v_en              : 1;	//    31
} PE_L9B0_PE1_R_LRCR_CTRL_02;

/*-----------------------------------------------------------------------------
	0x363c pe1_r_lrcr_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_R_LRCR_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3640 pe1_r_lrcr_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 2;	// 12:13 reserved
	UINT32 hist_r_window_h_bbd             : 1;	//    14
	UINT32 hist_r_window_h_en              : 1;	//    15
	UINT32 y0                              :12;	// 16:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 hist_r_window_v_bbd             : 1;	//    30
	UINT32 hist_r_window_v_en              : 1;	//    31
} PE_L9B0_PE1_R_LRCR_CTRL_04;

/*-----------------------------------------------------------------------------
	0x3644 pe1_r_lrcr_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_R_LRCR_CTRL_05;

/*-----------------------------------------------------------------------------
	0x3648 pe1_r_lrcr_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 2;	// 12:13 reserved
	UINT32 active_window_h_bbd             : 1;	//    14
	UINT32 active_window_h_en              : 1;	//    15
	UINT32 y0                              :12;	// 16:27
	UINT32                                 : 2;	// 28:29 reserved
	UINT32 active_window_v_bbd             : 1;	//    30
	UINT32 active_window_v_en              : 1;	//    31
} PE_L9B0_PE1_R_LRCR_CTRL_06;

/*-----------------------------------------------------------------------------
	0x364c pe1_r_lrcr_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_R_LRCR_CTRL_07;

/*-----------------------------------------------------------------------------
	0x3650 pe1_r_lrcr_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                        : 8;	//  0: 7
	UINT32 n_valid_bins                    : 8;	//  8:15
	UINT32 cdf_x1                          : 8;	// 16:23
	UINT32 cdf_x0                          : 8;	// 24:31
} PE_L9B0_PE1_R_LRCR_STAT_00;

/*-----------------------------------------------------------------------------
	0x3654 pe1_r_lrcr_stat_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                        : 8;	//  0: 7
	UINT32 n_valid_bins                    : 8;	//  8:15
	UINT32 cdf_x1                          : 8;	// 16:23
	UINT32 cdf_x0                          : 8;	// 24:31
} PE_L9B0_PE1_R_LRCR_STAT_01;

/*-----------------------------------------------------------------------------
	0x3658 pe1_r_lrcr_stat_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 max_hist                        : 8;	//  0: 7
	UINT32 n_valid_bins                    : 8;	//  8:15
	UINT32 cdf_x1                          : 8;	// 16:23
	UINT32 cdf_x0                          : 8;	// 24:31
} PE_L9B0_PE1_R_LRCR_STAT_02;

/*-----------------------------------------------------------------------------
	0x3670 pe1_r_dce_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dynamic_contrast_en             : 1;	//     0
	UINT32 hist_bin_mode                   : 2;	//  1: 2
	UINT32 hist_clear                      : 1;	//     3
	UINT32                                 : 2;	//  4: 5 reserved
	UINT32 window_mode_en                  : 1;	//     6
	UINT32 window_acquire                  : 1;	//     7
	UINT32 color_region0_sel               : 1;	//     8
	UINT32 color_region1_sel               : 1;	//     9
	UINT32 color_region2_sel               : 1;	//    10
	UINT32 color_region3_sel               : 1;	//    11
	UINT32 color_region4_sel               : 1;	//    12
	UINT32 color_region5_sel               : 1;	//    13
	UINT32 color_region6_sel               : 1;	//    14
	UINT32 color_region7_sel               : 1;	//    15
	UINT32 color_region8_sel               : 1;	//    16
	UINT32 color_region9_sel               : 1;	//    17
	UINT32 color_region10_sel              : 1;	//    18
	UINT32 color_region11_sel              : 1;	//    19
	UINT32 color_region12_sel              : 1;	//    20
	UINT32 color_region13_sel              : 1;	//    21
	UINT32 color_region14_sel              : 1;	//    22
	UINT32 color_region15_sel              : 1;	//    23
	UINT32 dce_domain_sel                  : 1;	//    24
	UINT32 win_selection                   : 1;	//    25
	UINT32                                 : 2;	// 26:27 reserved
	UINT32 histogram_mode                  : 2;	// 28:29
} PE_L9B0_PE1_R_DCE_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3674 pe1_r_dce_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hist_bin_min_position           : 8;	//  0: 7
	UINT32 hist_bin_max_position           : 8;	//  8:15
	UINT32 color_region_gain               : 8;	// 16:23
} PE_L9B0_PE1_R_DCE_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3678 pe1_r_dce_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 color_region_en                 : 1;	//     0
	UINT32 color_debug_en                  : 1;	//     1
	UINT32                                 : 2;	//  2: 3 reserved
	UINT32 y_grad_gain                     : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 cb_grad_gain                    : 2;	//  8: 9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 cr_grad_gain                    : 2;	// 12:13
} PE_L9B0_PE1_R_DCE_CTRL_02;

/*-----------------------------------------------------------------------------
	0x367c pe1_r_dce_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 y_range_min                     :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 y_range_max                     :10;	// 16:25
} PE_L9B0_PE1_R_DCE_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3680 pe1_r_dce_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 cb_range_min                    :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 cb_range_max                    :10;	// 16:25
} PE_L9B0_PE1_R_DCE_CTRL_04;

/*-----------------------------------------------------------------------------
	0x3684 pe1_r_dce_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 cr_range_min                    :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 cr_range_max                    :10;	// 16:25
} PE_L9B0_PE1_R_DCE_CTRL_05;

/*-----------------------------------------------------------------------------
	0x3688 pe1_r_dce_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_address                 : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 hif_dce_load                    : 1;	//     8
	UINT32                                 : 3;	//  9:11 reserved
	UINT32 hif_dce_ai                      : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_dce_enable                  : 1;	//    15
} PE_L9B0_PE1_R_DCE_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x368c pe1_r_dce_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_wdata_y                 :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dyc_wdata_x                 :10;	// 16:25
} PE_L9B0_PE1_R_DCE_IA_DATA;

/*-----------------------------------------------------------------------------
	0x3690 pe1_r_dce_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dyc_wdata_y_32nd            :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dyc_wdata_x_32nd            :10;	// 16:25
} PE_L9B0_PE1_R_DCE_CTRL_08;

/*-----------------------------------------------------------------------------
	0x36a0 pe1_r_dce_hist_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_hist_address                : 5;	//  0: 4
	UINT32                                 : 7;	//  5:11 reserved
	UINT32 hif_hist_ai                     : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_hist_enable                 : 1;	//    15
	UINT32 hif_status_address              : 3;	// 16:18
	UINT32                                 : 9;	// 19:27 reserved
	UINT32 hif_status_ai                   : 1;	//    28
	UINT32 hif_mask                        : 1;	//    29
} PE_L9B0_PE1_R_DCE_HIST_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x36a4 pe1_r_dce_hist_ia_data1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x36a8 pe1_r_dce_hsit_ia_data2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x36ac pe1_r_dse_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dynamic_saturation_en           : 1;	//     0
	UINT32 window_mode_en                  : 1;	//     1
	UINT32 window_acquire                  : 1;	//     2
	UINT32 win_selection                   : 1;	//     3
	UINT32                                 : 4;	//  4: 7 reserved
	UINT32 color_region0_sel               : 1;	//     8
	UINT32 color_region1_sel               : 1;	//     9
	UINT32 color_region2_sel               : 1;	//    10
	UINT32 color_region3_sel               : 1;	//    11
	UINT32 color_region4_sel               : 1;	//    12
	UINT32 color_region5_sel               : 1;	//    13
	UINT32 color_region6_sel               : 1;	//    14
	UINT32 color_region7_sel               : 1;	//    15
	UINT32 color_region8_sel               : 1;	//    16
	UINT32 color_region9_sel               : 1;	//    17
	UINT32 color_region10_sel              : 1;	//    18
	UINT32 color_region11_sel              : 1;	//    19
	UINT32 color_region12_sel              : 1;	//    20
	UINT32 color_region13_sel              : 1;	//    21
	UINT32 color_region14_sel              : 1;	//    22
	UINT32 color_region15_sel              : 1;	//    23
} PE_L9B0_PE1_R_DSE_CTRL_00;

/*-----------------------------------------------------------------------------
	0x36b0 pe1_r_dse_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32                                 :24;	//  0:23 reserved
	UINT32 color_region_gain               : 8;	// 24:31
} PE_L9B0_PE1_R_DSE_CTRL_01;

/*-----------------------------------------------------------------------------
	0x36b4 pe1_r_dse_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_wdata_y_32nd            :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dse_wdata_x_32nd            :10;	// 16:25
} PE_L9B0_PE1_R_DSE_CTRL_02;

/*-----------------------------------------------------------------------------
	0x36b8 pe1_r_dse_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_address                 : 5;	//  0: 4
	UINT32                                 : 3;	//  5: 7 reserved
	UINT32 hif_dse_load                    : 1;	//     8
	UINT32                                 : 3;	//  9:11 reserved
	UINT32 hif_dse_ai                      : 1;	//    12
	UINT32                                 : 2;	// 13:14 reserved
	UINT32 hif_dse_enable                  : 1;	//    15
} PE_L9B0_PE1_R_DSE_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x36bc pe1_r_dse_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 hif_dse_wdata_y                 :10;	//  0: 9
	UINT32                                 : 6;	// 10:15 reserved
	UINT32 hif_dse_wdata_x                 :10;	// 16:25
} PE_L9B0_PE1_R_DSE_IA_DATA;

/*-----------------------------------------------------------------------------
	0x36c0 pe1_r_wb_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 wb_en                           : 1;	//     0
	UINT32                                 :29;	//  1:29 reserved
	UINT32 gamma_en                        : 1;	//    30
	UINT32 degamma_en                      : 1;	//    31
} PE_L9B0_PE1_R_WB_CTRL_00;

/*-----------------------------------------------------------------------------
	0x36c4 pe1_r_wb_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 user_ctrl_g_gain                : 8;	//  0: 7
	UINT32 user_ctrl_b_gain                : 8;	//  8:15
	UINT32 user_ctrl_r_gain                : 8;	// 16:23
} PE_L9B0_PE1_R_WB_CTRL_01;

/*-----------------------------------------------------------------------------
	0x36c8 pe1_r_wb_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 user_ctrl_g_offset              : 8;	//  0: 7
	UINT32 user_ctrl_b_offset              : 8;	//  8:15
	UINT32 user_ctrl_r_offset              : 8;	// 16:23
} PE_L9B0_PE1_R_WB_CTRL_02;

/*-----------------------------------------------------------------------------
	0x36f0 pe1_r_gmc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_xpos                    :11;	//  0:10
	UINT32                                 : 1;	//    11 reserved
	UINT32 lut_wmask_g                     : 1;	//    12
	UINT32 lut_wmask_b                     : 1;	//    13
	UINT32 lut_wmask_r                     : 1;	//    14
	UINT32 pxl_rep_area                    : 1;	//    15
	UINT32 pxl_rep_ypos                    :12;	// 16:27
	UINT32 pxl_rep_disable_g               : 1;	//    28
	UINT32 pxl_rep_disable_b               : 1;	//    29
	UINT32 pxl_rep_disable_r               : 1;	//    30
	UINT32 pxl_rep_enable                  : 1;	//    31
} PE_L9B0_PE1_R_GMC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x36f4 pe1_r_gmc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_width                   :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 pxl_rep_height                  :12;	// 16:27
} PE_L9B0_PE1_R_GMC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x36f8 pe1_r_gmc_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pxl_rep_value_g                 :10;	//  0: 9
	UINT32 pxl_rep_value_b                 :10;	// 10:19
	UINT32 pxl_rep_value_r                 :10;	// 20:29
	UINT32 gmc_mode                        : 2;	// 30:31
} PE_L9B0_PE1_R_GMC_CTRL_02;

/*-----------------------------------------------------------------------------
	0x36fc pe1_r_gmc_ia_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 capture_addr                    :10;	//  0: 9
	UINT32                                 : 2;	// 10:11 reserved
	UINT32 capture_ai                      : 1;	//    12
	UINT32                                 : 3;	// 13:15 reserved
	UINT32 capture_num                     :11;	// 16:26
} PE_L9B0_PE1_R_GMC_IA_CTRL;

/*-----------------------------------------------------------------------------
	0x3700 pe1_r_gmc_ia_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 lut_data_g                      :10;	//  0: 9
	UINT32 lut_data_b                      :10;	// 10:19
	UINT32 lut_data_r                      :10;	// 20:29
	UINT32 capture_stat_started            : 1;	//    30
	UINT32 capture_stat_ended              : 1;	//    31
} PE_L9B0_PE1_R_GMC_IA_DATA;

/*-----------------------------------------------------------------------------
	0x3704 pe1_r_gmc_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 dither_en                       : 1;	//     0
	UINT32 decontour_en                    : 1;	//     1
	UINT32 dither_random_freeze_en         : 1;	//     2
	UINT32 demo_pattern_enable             : 1;	//     3
	UINT32 bit_mode                        : 2;	//  4: 5
	UINT32                                 : 2;	//  6: 7 reserved
	UINT32 decontour_gain_r                : 8;	//  8:15
	UINT32 decontour_gain_g                : 8;	// 16:23
	UINT32 decontour_gain_b                : 8;	// 24:31
} PE_L9B0_PE1_R_GMC_CTRL_03;

/*-----------------------------------------------------------------------------
	0x3720 pe1_r_sqm_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 outmux_debugmap                 : 4;	//  0: 3
	UINT32 iir                             : 4;	//  4: 7
	UINT32 i_score                         : 8;	//  8:15
	UINT32 v_score                         : 8;	// 16:23
	UINT32 l_score                         : 8;	// 24:31
} PE_L9B0_PE1_R_SQM_CTRL_0;

/*-----------------------------------------------------------------------------
	0x3724 pe1_r_sqm_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 v_limit                         : 8;	//  0: 7
	UINT32 l_limit                         : 8;	//  8:15
	UINT32 score_threshold                 : 8;	// 16:23
	UINT32 flat_threshold                  : 8;	// 24:31
} PE_L9B0_PE1_R_SQM_CTRL_1;

/*-----------------------------------------------------------------------------
	0x3728 pe1_r_sqm_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_x0                          :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 win_y0                          :11;	// 16:26
} PE_L9B0_PE1_R_SQM_CTRL_2;

/*-----------------------------------------------------------------------------
	0x372c pe1_r_sqm_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 win_x1                          :11;	//  0:10
	UINT32                                 : 5;	// 11:15 reserved
	UINT32 win_y1                          :11;	// 16:26
} PE_L9B0_PE1_R_SQM_CTRL_3;

/*-----------------------------------------------------------------------------
	0x3730 pe1_r_sqm_ctrl_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 charcter_delta_limit            : 8;	//  0: 7
	UINT32 boundary_width                  : 8;	//  8:15
	UINT32 video_height                    : 8;	// 16:23
} PE_L9B0_PE1_R_SQM_CTRL_4;

/*-----------------------------------------------------------------------------
	0x3734 pe1_r_sqm_ctrl_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 pc_threshold                    : 8;	//  0: 7
	UINT32 pc_delta_limit                  : 8;	//  8:15
	UINT32 pc_pixel_minimal_limit          : 8;	// 16:23
} PE_L9B0_PE1_R_SQM_CTRL_5;

/*-----------------------------------------------------------------------------
	0x3738 pe1_r_sqm_stat ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x3750 pe1_r_bbd2d_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 black_boundary_detection_enable : 1;	//     0
	UINT32 hysterisis_mode                 : 3;	//  1: 3
	UINT32                                 : 3;	//  4: 6 reserved
	UINT32 mode_selection                  : 1;	//     7
	UINT32 cnt_th                          : 8;	//  8:15
	UINT32 diff_th                         : 8;	// 16:23
	UINT32 vcnt                            : 8;	// 24:31
} PE_L9B0_PE1_R_BBD2D_CTRL_0;

/*-----------------------------------------------------------------------------
	0x3754 pe1_r_bbd2d_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x0                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y0                          :12;	// 16:27
} PE_L9B0_PE1_R_BBD2D_CTRL_1;

/*-----------------------------------------------------------------------------
	0x3758 pe1_r_bbd2d_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x1                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y1                          :12;	// 16:27
} PE_L9B0_PE1_R_BBD2D_CTRL_2;

/*-----------------------------------------------------------------------------
	0x375c pe1_r_bbd2d_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x0                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y0                              :12;	// 16:27
} PE_L9B0_PE1_R_BBD2D_STAT_0;

/*-----------------------------------------------------------------------------
	0x3760 pe1_r_bbd2d_stat_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x1                              :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y1                              :12;	// 16:27
} PE_L9B0_PE1_R_BBD2D_STAT_1;

/*-----------------------------------------------------------------------------
	0x3770 pe1_r_bbd3d_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 black_boundary_detection_enable : 1;	//     0
	UINT32 hysterisis_mode                 : 3;	//  1: 3
	UINT32                                 : 3;	//  4: 6 reserved
	UINT32 mode_selection                  : 1;	//     7
	UINT32 cnt_th                          : 8;	//  8:15
	UINT32 diff_th                         : 8;	// 16:23
	UINT32 vcnt                            : 8;	// 24:31
} PE_L9B0_PE1_R_BBD3D_CTRL_00;

/*-----------------------------------------------------------------------------
	0x3774 pe1_r_bbd3d_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x0                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y0                          :12;	// 16:27
	UINT32 bbd_read_control                : 2;	// 28:29
} PE_L9B0_PE1_R_BBD3D_CTRL_01;

/*-----------------------------------------------------------------------------
	0x3778 pe1_r_bbd3d_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 bbd_x1                          :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 bbd_y1                          :12;	// 16:27
} PE_L9B0_PE1_R_BBD3D_CTRL_02;

/*-----------------------------------------------------------------------------
	0x377c pe1_r_bbd3d_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32 x                               :12;	//  0:11
	UINT32                                 : 4;	// 12:15 reserved
	UINT32 y                               :12;	// 16:27
} PE_L9B0_PE1_R_BBD3D_STAT_0;

/*-----------------------------------------------------------------------------
	0x37dc pe1_r_r_hist_ia_data ''
------------------------------------------------------------------------------*/
/*	no field */

typedef struct {
	PE_L9B0_PE1_L_TOP_CTRL_00         pe1_l_top_ctrl_00;		// 0x1300 : ''
	PE_L9B0_PE1_L_TOP_CTRL_01         pe1_l_top_ctrl_01;		// 0x1304 : ''
	PE_L9B0_PE1_L_TOP_CTRL_02         pe1_l_top_ctrl_02;		// 0x1308 : ''
	PE_L9B0_PE1_L_TOP_CTRL_03         pe1_l_top_ctrl_03;		// 0x130c : ''
	UINT32                            reserved00[4];			// 0x1310 ~ 0x131c
	PE_L9B0_PE1_L_WIN1_CTRL_00        pe1_l_win1_ctrl_00;		// 0x1320 : ''
	PE_L9B0_PE1_L_WIN1_CTRL_01        pe1_l_win1_ctrl_01;		// 0x1324 : ''
	PE_L9B0_PE1_L_WIN1_CTRL_02        pe1_l_win1_ctrl_02;		// 0x1328 : ''
	PE_L9B0_PE1_L_WIN1_CTRL_03        pe1_l_win1_ctrl_03;		// 0x132c : ''
	PE_L9B0_PE1_L_WIN1_CTRL_04        pe1_l_win1_ctrl_04;		// 0x1330 : ''
	PE_L9B0_PE1_L_WIN2_CTRL_00        pe1_l_win2_ctrl_00;		// 0x1334 : ''
	PE_L9B0_PE1_L_WIN2_CTRL_01        pe1_l_win2_ctrl_01;		// 0x1338 : ''
	PE_L9B0_PE1_L_WIN2_CTRL_02        pe1_l_win2_ctrl_02;		// 0x133c : ''
	PE_L9B0_PE1_L_WIN2_CTRL_03        pe1_l_win2_ctrl_03;		// 0x1340 : ''
	PE_L9B0_PE1_L_WIN2_CTRL_04        pe1_l_win2_ctrl_04;		// 0x1344 : ''
	UINT32                            reserved01[2];			// 0x1348 ~ 0x134c
	PE_L9B0_PE1_L_APL_CTRL_00         pe1_l_apl_ctrl_00;		// 0x1350 : ''
	PE_L9B0_PE1_L_APL_CTRL_01         pe1_l_apl_ctrl_01;		// 0x1354 : ''
	PE_L9B0_PE1_L_APL_CTRL_02         pe1_l_apl_ctrl_02;		// 0x1358 : ''
	PE_L9B0_PE1_L_APL_STAT_00         pe1_l_apl_stat_00;		// 0x135c : ''
	PE_L9B0_PE1_L_APL_STAT_01         pe1_l_apl_stat_01;		// 0x1360 : ''
	PE_L9B0_PE1_L_APL_STAT_02         pe1_l_apl_stat_02;		// 0x1364 : ''
	PE_L9B0_PE1_L_APL_STAT_03         pe1_l_apl_stat_03;		// 0x1368 : ''
	UINT32                            reserved02;				// 0x136c
	PE_L9B0_PE1_L_TPG_CTRL_00         pe1_l_tpg_ctrl_00;		// 0x1370 : ''
	PE_L9B0_PE1_L_TPG_CTRL_01         pe1_l_tpg_ctrl_01;		// 0x1374 : ''
	PE_L9B0_PE1_L_TPG_CTRL_02         pe1_l_tpg_ctrl_02;		// 0x1378 : ''
	PE_L9B0_PE1_L_TPG_CTRL_03         pe1_l_tpg_ctrl_03;		// 0x137c : ''
	PE_L9B0_PE1_L_TPG_CTRL_04         pe1_l_tpg_ctrl_04;		// 0x1380 : ''
	PE_L9B0_PE1_L_TPG_IA_CTRL         pe1_l_tpg_ia_ctrl;		// 0x1384 : ''
	PE_L9B0_PE1_L_TPG_IA_DATA         pe1_l_tpg_ia_data;		// 0x1388 : ''
	UINT32                            reserved03[5];			// 0x138c ~ 0x139c
	PE_L9B0_PE1_L_FILM_CTRL_00        pe1_l_film_ctrl_00;		// 0x13a0 : ''
	PE_L9B0_PE1_L_FILM_CTRL_01        pe1_l_film_ctrl_01;		// 0x13a4 : ''
	PE_L9B0_PE1_L_FILM_CTRL_02        pe1_l_film_ctrl_02;		// 0x13a8 : ''
	UINT32                            reserved04;				// 0x13ac
	PE_L9B0_PE1_L_WIN3_CTRL_00        pe1_l_win3_ctrl_00;		// 0x13b0 : ''
	PE_L9B0_PE1_L_WIN3_CTRL_01        pe1_l_win3_ctrl_01;		// 0x13b4 : ''
	PE_L9B0_PE1_L_WIN3_CTRL_02        pe1_l_win3_ctrl_02;		// 0x13b8 : ''
	PE_L9B0_PE1_L_WIN3_CTRL_03        pe1_l_win3_ctrl_03;		// 0x13bc : ''
	PE_L9B0_PE1_L_WIN3_CTRL_04        pe1_l_win3_ctrl_04;		// 0x13c0 : ''
	UINT32                            reserved05[3];			// 0x13c4 ~ 0x13cc
	PE_L9B0_PE1_L_DERH_CTRL_00        pe1_l_derh_ctrl_00;		// 0x13d0 : ''
	PE_L9B0_PE1_L_DERH_CTRL_01        pe1_l_derh_ctrl_01;		// 0x13d4 : ''
	PE_L9B0_PE1_L_DERH_CTRL_02        pe1_l_derh_ctrl_02;		// 0x13d8 : ''
	PE_L9B0_PE1_L_DERH_CTRL_03        pe1_l_derh_ctrl_03;		// 0x13dc : ''
	PE_L9B0_PE1_L_DERH_CTRL_04        pe1_l_derh_ctrl_04;		// 0x13e0 : ''
	PE_L9B0_PE1_L_DERH_CTRL_05        pe1_l_derh_ctrl_05;		// 0x13e4 : ''
	PE_L9B0_PE1_L_DERH_CTRL_06        pe1_l_derh_ctrl_06;		// 0x13e8 : ''
	PE_L9B0_PE1_L_DERH_CTRL_07        pe1_l_derh_ctrl_07;		// 0x13ec : ''
	PE_L9B0_PE1_L_DERH_CTRL_08        pe1_l_derh_ctrl_08;		// 0x13f0 : ''
	PE_L9B0_PE1_L_DERH_CTRL_09        pe1_l_derh_ctrl_09;		// 0x13f4 : ''
	UINT32                            reserved06[2];			// 0x13f8 ~ 0x13fc
	PE_L9B0_PE1_L_DERV_CTRL_0         pe1_l_derv_ctrl_0;		// 0x1400 : ''
	PE_L9B0_PE1_L_DERV_CTRL_1         pe1_l_derv_ctrl_1;		// 0x1404 : ''
	PE_L9B0_PE1_L_DERV_CTRL_2         pe1_l_derv_ctrl_2;		// 0x1408 : ''
	PE_L9B0_PE1_L_DERV_CTRL_3         pe1_l_derv_ctrl_3;		// 0x140c : ''
	PE_L9B0_PE1_L_DP_CTRL_00          pe1_l_dp_ctrl_00;		// 0x1410 : ''
	PE_L9B0_PE1_L_DP_CTRL_01          pe1_l_dp_ctrl_01;		// 0x1414 : ''
	UINT32                            pe1_l_dp_ctrl_02;		// 0x1418 : ''
	UINT32                            pe1_l_dp_ctrl_03;		// 0x141c : ''
	PE_L9B0_PE1_L_CORING_STAT_00      pe1_l_coring_stat_00;	// 0x1420 : ''
	PE_L9B0_PE1_L_CORING_STAT_01      pe1_l_coring_stat_01;	// 0x1424 : ''
	UINT32                            pe1_l_coring_stat_02;	// 0x1428 : ''
	UINT32                            pe1_l_coring_stat_03;	// 0x142c : ''
	UINT32                            reserved07[16];			// 0x1430 ~ 0x146c
	PE_L9B0_PE1_L_DERH_CTRL_0A        pe1_l_derh_ctrl_0a;		// 0x1470 : ''
	PE_L9B0_PE1_L_DERH_CTRL_0B        pe1_l_derh_ctrl_0b;		// 0x1474 : ''
	PE_L9B0_PE1_L_DERH_CTRL_0C        pe1_l_derh_ctrl_0c;		// 0x1478 : ''
	UINT32                            pe1_l_derh_ctrl_0d;		// 0x147c : ''
	UINT32                            reserved08[4];			// 0x1480 ~ 0x148c
	PE_L9B0_PE1_L_SP_CTRL_00          pe1_l_sp_ctrl_00;		// 0x1490 : ''
	PE_L9B0_PE1_L_SP_CTRL_01          pe1_l_sp_ctrl_01;		// 0x1494 : ''
	PE_L9B0_PE1_L_SP_CTRL_02          pe1_l_sp_ctrl_02;		// 0x1498 : ''
	UINT32                            pe1_l_sp_ctrl_03;		// 0x149c : ''
	PE_L9B0_PE1_L_SP_CTRL_04          pe1_l_sp_ctrl_04;		// 0x14a0 : ''
	UINT32                            reserved09;				// 0x14a4
	UINT32                            pe1_l_sp_ctrl_05;		// 0x14a8 : ''
	PE_L9B0_PE1_L_SP_CTRL_06          pe1_l_sp_ctrl_06;		// 0x14ac : ''
	PE_L9B0_PE1_L_SP_CTRL_07          pe1_l_sp_ctrl_07;		// 0x14b0 : ''
	PE_L9B0_PE1_L_SP_CTRL_08          pe1_l_sp_ctrl_08;		// 0x14b4 : ''
	PE_L9B0_PE1_L_SP_CTRL_09          pe1_l_sp_ctrl_09;		// 0x14b8 : ''
	PE_L9B0_PE1_L_SP_CTRL_0A          pe1_l_sp_ctrl_0a;		// 0x14bc : ''
	PE_L9B0_PE1_L_SP_CTRL_0B          pe1_l_sp_ctrl_0b;		// 0x14c0 : ''
	PE_L9B0_PE1_L_SP_CTRL_0C          pe1_l_sp_ctrl_0c;		// 0x14c4 : ''
	UINT32                            reserved10[2];			// 0x14c8 ~ 0x14cc
	PE_L9B0_PE1_L_DEBUG_CTRL_00       pe1_l_debug_ctrl_00;		// 0x14d0 : ''
	UINT32                            pe1_l_debug_ctrl_01;		// 0x14d4 : ''
	UINT32                            reserved11[6];			// 0x14d8 ~ 0x14ec
	PE_L9B0_PE1_L_MP_CTRL_00          pe1_l_mp_ctrl_00;		// 0x14f0 : ''
	PE_L9B0_PE1_L_MP_CTRL_01          pe1_l_mp_ctrl_01;		// 0x14f4 : ''
	PE_L9B0_PE1_L_MP_CTRL_02          pe1_l_mp_ctrl_02;		// 0x14f8 : ''
	UINT32                            pe1_l_mp_ctrl_03;		// 0x14fc : ''
	PE_L9B0_PE1_L_MP_CTRL_04          pe1_l_mp_ctrl_04;		// 0x1500 : ''
	UINT32                            reserved12;				// 0x1504
	UINT32                            pe1_l_mp_ctrl_05;		// 0x1508 : ''
	PE_L9B0_PE1_L_MP_CTRL_06          pe1_l_mp_ctrl_06;		// 0x150c : ''
	PE_L9B0_PE1_L_MP_CTRL_07          pe1_l_mp_ctrl_07;		// 0x1510 : ''
	PE_L9B0_PE1_L_MP_CTRL_08          pe1_l_mp_ctrl_08;		// 0x1514 : ''
	PE_L9B0_PE1_L_MP_CTRL_09          pe1_l_mp_ctrl_09;		// 0x1518 : ''
	PE_L9B0_PE1_L_MP_CTRL_0A          pe1_l_mp_ctrl_0a;		// 0x151c : ''
	PE_L9B0_PE1_L_MP_CTRL_0B          pe1_l_mp_ctrl_0b;		// 0x1520 : ''
	PE_L9B0_PE1_L_MP_CTRL_0C          pe1_l_mp_ctrl_0c;		// 0x1524 : ''
	UINT32                            reserved13[2];			// 0x1528 ~ 0x152c
	PE_L9B0_PE1_L_CTI_CTRL_00         pe1_l_cti_ctrl_00;		// 0x1530 : ''
	UINT32                            pe1_l_cti_ctrl_01;		// 0x1534 : ''
	PE_L9B0_PE1_L_CTI_CTRL_02         pe1_l_cti_ctrl_02;		// 0x1538 : ''
	UINT32                            reserved14[5];			// 0x153c ~ 0x154c
	PE_L9B0_PE1_L_BLUR_CTRL           pe1_l_blur_ctrl;			// 0x1550 : ''
	UINT32                            reserved15[3];			// 0x1554 ~ 0x155c
	PE_L9B0_PE1_L_CORING_CTRL_00      pe1_l_coring_ctrl_00;	// 0x1560 : ''
	PE_L9B0_PE1_L_CORING_CTRL_01      pe1_l_coring_ctrl_01;	// 0x1564 : ''
	PE_L9B0_PE1_L_CORING_CTRL_02      pe1_l_coring_ctrl_02;	// 0x1568 : ''
	PE_L9B0_PE1_L_CORING_CTRL_03      pe1_l_coring_ctrl_03;	// 0x156c : ''
	PE_L9B0_PE1_L_CORING_CTRL_04      pe1_l_coring_ctrl_04;	// 0x1570 : ''
	PE_L9B0_PE1_L_CORING_CTRL_05      pe1_l_coring_ctrl_05;	// 0x1574 : ''
	PE_L9B0_PE1_L_CORING_CTRL_06      pe1_l_coring_ctrl_06;	// 0x1578 : ''
	PE_L9B0_PE1_L_CORING_CTRL_07      pe1_l_coring_ctrl_07;	// 0x157c : ''
	PE_L9B0_PE1_L_CORING_CTRL_08      pe1_l_coring_ctrl_08;	// 0x1580 : ''
	PE_L9B0_PE1_L_CORING_CTRL_09      pe1_l_coring_ctrl_09;	// 0x1584 : ''
	UINT32                            reserved16[2];			// 0x1588 ~ 0x158c
	PE_L9B0_PE1_L_DJ_CTRL_00          pe1_l_dj_ctrl_00;		// 0x1590 : ''
	PE_L9B0_PE1_L_DJ_CTRL_01          pe1_l_dj_ctrl_01;		// 0x1594 : ''
	PE_L9B0_PE1_L_DJ_CTRL_02          pe1_l_dj_ctrl_02;		// 0x1598 : ''
	PE_L9B0_PE1_L_DJ_CTRL_03          pe1_l_dj_ctrl_03;		// 0x159c : ''
	PE_L9B0_PE1_L_LEVEL_CTRL_00       pe1_l_level_ctrl_00;		// 0x15a0 : ''
	PE_L9B0_PE1_L_VSPYC_CTRL_00       pe1_l_vspyc_ctrl_00;		// 0x15a4 : ''
	PE_L9B0_PE1_L_VSPYC_CTRL_01       pe1_l_vspyc_ctrl_01;		// 0x15a8 : ''
	UINT32                            reserved17;				// 0x15ac
	PE_L9B0_PE1_L_VSPRGB_CTRL_00      pe1_l_vsprgb_ctrl_00;	// 0x15b0 : ''
	UINT32                            reserved18[3];			// 0x15b4 ~ 0x15bc
	PE_L9B0_PE1_L_XVY_CTRL_00         pe1_l_xvy_ctrl_00;		// 0x15c0 : ''
	PE_L9B0_PE1_L_XVY_CTRL_01         pe1_l_xvy_ctrl_01;		// 0x15c4 : ''
	PE_L9B0_PE1_L_XVY_CTRL_02         pe1_l_xvy_ctrl_02;		// 0x15c8 : ''
	PE_L9B0_PE1_L_XVY_CTRL_03         pe1_l_xvy_ctrl_03;		// 0x15cc : ''
	PE_L9B0_PE1_L_XVY_CTRL_04         pe1_l_xvy_ctrl_04;		// 0x15d0 : ''
	PE_L9B0_PE1_L_XVY_CTRL_05         pe1_l_xvy_ctrl_05;		// 0x15d4 : ''
	PE_L9B0_PE1_L_XVY_CTRL_06         pe1_l_xvy_ctrl_06;		// 0x15d8 : ''
	PE_L9B0_PE1_L_XVY_CTRL_07         pe1_l_xvy_ctrl_07;		// 0x15dc : ''
	PE_L9B0_PE1_L_XVY_CTRL_08         pe1_l_xvy_ctrl_08;		// 0x15e0 : ''
	PE_L9B0_PE1_L_XVY_CTRL_09         pe1_l_xvy_ctrl_09;		// 0x15e4 : ''
	PE_L9B0_PE1_L_XVY_CTRL_0A         pe1_l_xvy_ctrl_0a;		// 0x15e8 : ''
	PE_L9B0_PE1_L_XVY_CTRL_0B         pe1_l_xvy_ctrl_0b;		// 0x15ec : ''
	PE_L9B0_PE1_L_XVY_CTRL_0C         pe1_l_xvy_ctrl_0c;		// 0x15f0 : ''
	PE_L9B0_PE1_L_XVY_CTRL_0D         pe1_l_xvy_ctrl_0d;		// 0x15f4 : ''
	UINT32                            reserved19[2];			// 0x15f8 ~ 0x15fc
	PE_L9B0_PE1_L_CEN_CTRL_00         pe1_l_cen_ctrl_00;		// 0x1600 : ''
	PE_L9B0_PE1_L_CEN_CTRL_01         pe1_l_cen_ctrl_01;		// 0x1604 : ''
	PE_L9B0_PE1_L_CEN_CTRL_02         pe1_l_cen_ctrl_02;		// 0x1608 : ''
	PE_L9B0_PE1_L_CEN_CTRL_03         pe1_l_cen_ctrl_03;		// 0x160c : ''
	PE_L9B0_PE1_L_CEN_CTRL_04         pe1_l_cen_ctrl_04;		// 0x1610 : ''
	PE_L9B0_PE1_L_CEN_IA_CTRL         pe1_l_cen_ia_ctrl;		// 0x1614 : ''
	PE_L9B0_PE1_L_CEN_IA_DATA         pe1_l_cen_ia_data;		// 0x1618 : ''
	UINT32                            reserved20[5];			// 0x161c ~ 0x162c
	PE_L9B0_PE1_L_LRCR_CTRL_00        pe1_l_lrcr_ctrl_00;		// 0x1630 : ''
	PE_L9B0_PE1_L_LRCR_CTRL_01        pe1_l_lrcr_ctrl_01;		// 0x1634 : ''
	PE_L9B0_PE1_L_LRCR_CTRL_02        pe1_l_lrcr_ctrl_02;		// 0x1638 : ''
	PE_L9B0_PE1_L_LRCR_CTRL_03        pe1_l_lrcr_ctrl_03;		// 0x163c : ''
	PE_L9B0_PE1_L_LRCR_CTRL_04        pe1_l_lrcr_ctrl_04;		// 0x1640 : ''
	PE_L9B0_PE1_L_LRCR_CTRL_05        pe1_l_lrcr_ctrl_05;		// 0x1644 : ''
	PE_L9B0_PE1_L_LRCR_CTRL_06        pe1_l_lrcr_ctrl_06;		// 0x1648 : ''
	PE_L9B0_PE1_L_LRCR_CTRL_07        pe1_l_lrcr_ctrl_07;		// 0x164c : ''
	PE_L9B0_PE1_L_LRCR_STAT_00        pe1_l_lrcr_stat_00;		// 0x1650 : ''
	PE_L9B0_PE1_L_LRCR_STAT_01        pe1_l_lrcr_stat_01;		// 0x1654 : ''
	PE_L9B0_PE1_L_LRCR_STAT_02        pe1_l_lrcr_stat_02;		// 0x1658 : ''
	UINT32                            reserved21[5];			// 0x165c ~ 0x166c
	PE_L9B0_PE1_L_DCE_CTRL_00         pe1_l_dce_ctrl_00;		// 0x1670 : ''
	PE_L9B0_PE1_L_DCE_CTRL_01         pe1_l_dce_ctrl_01;		// 0x1674 : ''
	PE_L9B0_PE1_L_DCE_CTRL_02         pe1_l_dce_ctrl_02;		// 0x1678 : ''
	PE_L9B0_PE1_L_DCE_CTRL_03         pe1_l_dce_ctrl_03;		// 0x167c : ''
	PE_L9B0_PE1_L_DCE_CTRL_04         pe1_l_dce_ctrl_04;		// 0x1680 : ''
	PE_L9B0_PE1_L_DCE_CTRL_05         pe1_l_dce_ctrl_05;		// 0x1684 : ''
	PE_L9B0_PE1_L_DCE_IA_CTRL         pe1_l_dce_ia_ctrl;		// 0x1688 : ''
	PE_L9B0_PE1_L_DCE_IA_DATA         pe1_l_dce_ia_data;		// 0x168c : ''
	PE_L9B0_PE1_L_DCE_CTRL_08         pe1_l_dce_ctrl_08;		// 0x1690 : ''
	UINT32                            reserved22[3];			// 0x1694 ~ 0x169c
	PE_L9B0_PE1_L_DCE_HIST_IA_CTRL    pe1_l_dce_hist_ia_ctrl;	// 0x16a0 : ''
	UINT32                            pe1_l_dce_hist_ia_data1;	// 0x16a4 : ''
	UINT32                            pe1_l_dce_hsit_ia_data2;	// 0x16a8 : ''
	PE_L9B0_PE1_L_DSE_CTRL_00         pe1_l_dse_ctrl_00;		// 0x16ac : ''
	PE_L9B0_PE1_L_DSE_CTRL_01         pe1_l_dse_ctrl_01;		// 0x16b0 : ''
	PE_L9B0_PE1_L_DSE_CTRL_02         pe1_l_dse_ctrl_02;		// 0x16b4 : ''
	PE_L9B0_PE1_L_DSE_IA_CTRL         pe1_l_dse_ia_ctrl;		// 0x16b8 : ''
	PE_L9B0_PE1_L_DSE_IA_DATA         pe1_l_dse_ia_data;		// 0x16bc : ''
	PE_L9B0_PE1_L_WB_CTRL_00          pe1_l_wb_ctrl_00;		// 0x16c0 : ''
	PE_L9B0_PE1_L_WB_CTRL_01          pe1_l_wb_ctrl_01;		// 0x16c4 : ''
	PE_L9B0_PE1_L_WB_CTRL_02          pe1_l_wb_ctrl_02;		// 0x16c8 : ''
	UINT32                            reserved23[9];			// 0x16cc ~ 0x16ec
	PE_L9B0_PE1_L_GMC_CTRL_00         pe1_l_gmc_ctrl_00;		// 0x16f0 : ''
	PE_L9B0_PE1_L_GMC_CTRL_01         pe1_l_gmc_ctrl_01;		// 0x16f4 : ''
	PE_L9B0_PE1_L_GMC_CTRL_02         pe1_l_gmc_ctrl_02;		// 0x16f8 : ''
	PE_L9B0_PE1_L_GMC_IA_CTRL         pe1_l_gmc_ia_ctrl;		// 0x16fc : ''
	PE_L9B0_PE1_L_GMC_IA_DATA         pe1_l_gmc_ia_data;		// 0x1700 : ''
	PE_L9B0_PE1_L_GMC_CTRL_03         pe1_l_gmc_ctrl_03;		// 0x1704 : ''
	UINT32                            reserved24[6];			// 0x1708 ~ 0x171c
	PE_L9B0_PE1_L_SQM_CTRL_0          pe1_l_sqm_ctrl_0;		// 0x1720 : ''
	PE_L9B0_PE1_L_SQM_CTRL_1          pe1_l_sqm_ctrl_1;		// 0x1724 : ''
	PE_L9B0_PE1_L_SQM_CTRL_2          pe1_l_sqm_ctrl_2;		// 0x1728 : ''
	PE_L9B0_PE1_L_SQM_CTRL_3          pe1_l_sqm_ctrl_3;		// 0x172c : ''
	PE_L9B0_PE1_L_SQM_CTRL_4          pe1_l_sqm_ctrl_4;		// 0x1730 : ''
	PE_L9B0_PE1_L_SQM_CTRL_5          pe1_l_sqm_ctrl_5;		// 0x1734 : ''
	UINT32                            pe1_l_sqm_stat;			// 0x1738 : ''
	UINT32                            reserved25[5];			// 0x173c ~ 0x174c
	PE_L9B0_PE1_L_BBD2D_CTRL_0        pe1_l_bbd2d_ctrl_0;		// 0x1750 : ''
	PE_L9B0_PE1_L_BBD2D_CTRL_1        pe1_l_bbd2d_ctrl_1;		// 0x1754 : ''
	PE_L9B0_PE1_L_BBD2D_CTRL_2        pe1_l_bbd2d_ctrl_2;		// 0x1758 : ''
	PE_L9B0_PE1_L_BBD2D_STAT_0        pe1_l_bbd2d_stat_0;		// 0x175c : ''
	PE_L9B0_PE1_L_BBD2D_STAT_1        pe1_l_bbd2d_stat_1;		// 0x1760 : ''
	UINT32                            reserved26[3];			// 0x1764 ~ 0x176c
	PE_L9B0_PE1_L_BBD3D_CTRL_00       pe1_l_bbd3d_ctrl_00;		// 0x1770 : ''
	PE_L9B0_PE1_L_BBD3D_CTRL_01       pe1_l_bbd3d_ctrl_01;		// 0x1774 : ''
	PE_L9B0_PE1_L_BBD3D_CTRL_02       pe1_l_bbd3d_ctrl_02;		// 0x1778 : ''
	PE_L9B0_PE1_L_BBD3D_STAT_0        pe1_l_bbd3d_stat_0;		// 0x177c : ''
	UINT32                            reserved27[4];			// 0x1780 ~ 0x178c
	UINT32                            pe1_wcp_ctrl_00;			// 0x1790 : ''
	PE_L9B0_PE1_WCP_CTRL_01           pe1_wcp_ctrl_01;			// 0x1794 : ''
	PE_L9B0_PE1_WCP_CTRL_02           pe1_wcp_ctrl_02;			// 0x1798 : ''
	PE_L9B0_PE1_WCP_CTRL_03           pe1_wcp_ctrl_03;			// 0x179c : ''
	PE_L9B0_PE1_WCP_CTRL_04           pe1_wcp_ctrl_04;			// 0x17a0 : ''
	PE_L9B0_PE1_WCP_CTRL_05           pe1_wcp_ctrl_05;			// 0x17a4 : ''
	PE_L9B0_PE1_WCP_CTRL_06           pe1_wcp_ctrl_06;			// 0x17a8 : ''
	UINT32                            reserved28;				// 0x17ac
	PE_L9B0_PE1_L_G_HIST_IA_CTRL      pe1_l_g_hist_ia_ctrl;	// 0x17b0 : ''
	UINT32                            pe1_l_g_hist_ia_data;	// 0x17b4 : ''
	PE_L9B0_PE1_L_B_HIST_IA_CTRL      pe1_l_b_hist_ia_ctrl;	// 0x17b8 : ''
	UINT32                            pe1_l_b_hist_ia_data;	// 0x17bc : ''
	PE_L9B0_PE1_L_R_HIST_IA_CTRL      pe1_l_r_hist_ia_ctrl;	// 0x17c0 : ''
	UINT32                            pe1_l_r_hist_ia_data;	// 0x17c4 : ''
	PE_L9B0_PE1_R_G_HIST_IA_CTRL      pe1_r_g_hist_ia_ctrl;	// 0x17c8 : ''
	UINT32                            pe1_r_g_hist_ia_data;	// 0x17cc : ''
	PE_L9B0_PE1_R_B_HIST_IA_CTRL      pe1_r_b_hist_ia_ctrl;	// 0x17d0 : ''
	UINT32                            pe1_r_b_hist_ia_data;	// 0x17d4 : ''
	PE_L9B0_PE1_R_R_HIST_IA_CTRL      pe1_r_r_hist_ia_ctrl;	// 0x17d8 : ''
	UINT32                            pe1_r_r_hist_ia_data;	// 0x17dc : ''
} PE_P1L_REG_L9B0_T;

typedef struct {
	PE_L9B0_PE1_R_TOP_CTRL_00         pe1_r_top_ctrl_00;		// 0x3300 : ''
	PE_L9B0_PE1_R_TOP_CTRL_01         pe1_r_top_ctrl_01;		// 0x3304 : ''
	PE_L9B0_PE1_R_TOP_CTRL_02         pe1_r_top_ctrl_02;		// 0x3308 : ''
	PE_L9B0_PE1_R_TOP_CTRL_03         pe1_r_top_ctrl_03;		// 0x330c : ''
	UINT32                            reserved29[4];			// 0x3310 ~ 0x331c
	PE_L9B0_PE1_R_WIN1_CTRL_00        pe1_r_win1_ctrl_00;		// 0x3320 : ''
	PE_L9B0_PE1_R_WIN1_CTRL_01        pe1_r_win1_ctrl_01;		// 0x3324 : ''
	PE_L9B0_PE1_R_WIN1_CTRL_02        pe1_r_win1_ctrl_02;		// 0x3328 : ''
	PE_L9B0_PE1_R_WIN1_CTRL_03        pe1_r_win1_ctrl_03;		// 0x332c : ''
	PE_L9B0_PE1_R_WIN1_CTRL_04        pe1_r_win1_ctrl_04;		// 0x3330 : ''
	PE_L9B0_PE1_R_WIN2_CTRL_00        pe1_r_win2_ctrl_00;		// 0x3334 : ''
	PE_L9B0_PE1_R_WIN2_CTRL_01        pe1_r_win2_ctrl_01;		// 0x3338 : ''
	PE_L9B0_PE1_R_WIN2_CTRL_02        pe1_r_win2_ctrl_02;		// 0x333c : ''
	PE_L9B0_PE1_R_WIN2_CTRL_03        pe1_r_win2_ctrl_03;		// 0x3340 : ''
	PE_L9B0_PE1_R_WIN2_CTRL_04        pe1_r_win2_ctrl_04;		// 0x3344 : ''
	UINT32                            reserved30[2];			// 0x3348 ~ 0x334c
	PE_L9B0_PE1_R_APL_CTRL_00         pe1_r_apl_ctrl_00;		// 0x3350 : ''
	PE_L9B0_PE1_R_APL_CTRL_01         pe1_r_apl_ctrl_01;		// 0x3354 : ''
	PE_L9B0_PE1_R_APL_CTRL_02         pe1_r_apl_ctrl_02;		// 0x3358 : ''
	PE_L9B0_PE1_R_APL_STAT_00         pe1_r_apl_stat_00;		// 0x335c : ''
	PE_L9B0_PE1_R_APL_STAT_01         pe1_r_apl_stat_01;		// 0x3360 : ''
	PE_L9B0_PE1_R_APL_STAT_02         pe1_r_apl_stat_02;		// 0x3364 : ''
	PE_L9B0_PE1_R_APL_STAT_03         pe1_r_apl_stat_03;		// 0x3368 : ''
	UINT32                            reserved31[13];			// 0x336c ~ 0x339c
	PE_L9B0_PE1_R_FILM_CTRL_00        pe1_r_film_ctrl_00;		// 0x33a0 : ''
	PE_L9B0_PE1_R_FILM_CTRL_01        pe1_r_film_ctrl_01;		// 0x33a4 : ''
	PE_L9B0_PE1_R_FILM_CTRL_02        pe1_r_film_ctrl_02;		// 0x33a8 : ''
	UINT32                            reserved32;				// 0x33ac
	PE_L9B0_PE1_R_WIN3_CTRL_00        pe1_r_win3_ctrl_00;		// 0x33b0 : ''
	PE_L9B0_PE1_R_WIN3_CTRL_01        pe1_r_win3_ctrl_01;		// 0x33b4 : ''
	PE_L9B0_PE1_R_WIN3_CTRL_02        pe1_r_win3_ctrl_02;		// 0x33b8 : ''
	PE_L9B0_PE1_R_WIN3_CTRL_03        pe1_r_win3_ctrl_03;		// 0x33bc : ''
	PE_L9B0_PE1_R_WIN3_CTRL_04        pe1_r_win3_ctrl_04;		// 0x33c0 : ''
	UINT32                            reserved33[3];			// 0x33c4 ~ 0x33cc
	PE_L9B0_PE1_R_DERH_CTRL_00        pe1_r_derh_ctrl_00;		// 0x33d0 : ''
	PE_L9B0_PE1_R_DERH_CTRL_01        pe1_r_derh_ctrl_01;		// 0x33d4 : ''
	PE_L9B0_PE1_R_DERH_CTRL_02        pe1_r_derh_ctrl_02;		// 0x33d8 : ''
	PE_L9B0_PE1_R_DERH_CTRL_03        pe1_r_derh_ctrl_03;		// 0x33dc : ''
	PE_L9B0_PE1_R_DERH_CTRL_04        pe1_r_derh_ctrl_04;		// 0x33e0 : ''
	PE_L9B0_PE1_R_DERH_CTRL_05        pe1_r_derh_ctrl_05;		// 0x33e4 : ''
	PE_L9B0_PE1_R_DERH_CTRL_06        pe1_r_derh_ctrl_06;		// 0x33e8 : ''
	PE_L9B0_PE1_R_DERH_CTRL_07        pe1_r_derh_ctrl_07;		// 0x33ec : ''
	PE_L9B0_PE1_R_DERH_CTRL_08        pe1_r_derh_ctrl_08;		// 0x33f0 : ''
	PE_L9B0_PE1_R_DERH_CTRL_09        pe1_r_derh_ctrl_09;		// 0x33f4 : ''
	UINT32                            reserved34[2];			// 0x33f8 ~ 0x33fc
	PE_L9B0_PE1_R_DERV_CTRL_0         pe1_r_derv_ctrl_0;		// 0x3400 : ''
	PE_L9B0_PE1_R_DERV_CTRL_1         pe1_r_derv_ctrl_1;		// 0x3404 : ''
	PE_L9B0_PE1_R_DERV_CTRL_2         pe1_r_derv_ctrl_2;		// 0x3408 : ''
	PE_L9B0_PE1_R_DERV_CTRL_3         pe1_r_derv_ctrl_3;		// 0x340c : ''
	PE_L9B0_PE1_R_DP_CTRL_00          pe1_r_dp_ctrl_00;		// 0x3410 : ''
	PE_L9B0_PE1_R_DP_CTRL_01          pe1_r_dp_ctrl_01;		// 0x3414 : ''
	UINT32                            pe1_r_dp_ctrl_02;		// 0x3418 : ''
	UINT32                            pe1_r_dp_ctrl_03;		// 0x341c : ''
	PE_L9B0_PE1_R_CORING_STAT_00      pe1_r_coring_stat_00;	// 0x3420 : ''
	PE_L9B0_PE1_R_CORING_STAT_01      pe1_r_coring_stat_01;	// 0x3424 : ''
	UINT32                            pe1_r_coring_stat_02;	// 0x3428 : ''
	UINT32                            pe1_r_coring_stat_03;	// 0x342c : ''
	UINT32                            reserved35[16];			// 0x3430 ~ 0x346c
	PE_L9B0_PE1_R_DERH_CTRL_0A        pe1_r_derh_ctrl_0a;		// 0x3470 : ''
	PE_L9B0_PE1_R_DERH_CTRL_0B        pe1_r_derh_ctrl_0b;		// 0x3474 : ''
	PE_L9B0_PE1_R_DERH_CTRL_0C        pe1_r_derh_ctrl_0c;		// 0x3478 : ''
	UINT32                            pe1_r_derh_ctrl_0d;		// 0x347c : ''
	UINT32                            reserved36[4];			// 0x3480 ~ 0x348c
	PE_L9B0_PE1_R_SP_CTRL_00          pe1_r_sp_ctrl_00;		// 0x3490 : ''
	PE_L9B0_PE1_R_SP_CTRL_01          pe1_r_sp_ctrl_01;		// 0x3494 : ''
	PE_L9B0_PE1_R_SP_CTRL_02          pe1_r_sp_ctrl_02;		// 0x3498 : ''
	UINT32                            pe1_r_sp_ctrl_03;		// 0x349c : ''
	PE_L9B0_PE1_R_SP_CTRL_04          pe1_r_sp_ctrl_04;		// 0x34a0 : ''
	UINT32                            reserved37;				// 0x34a4
	UINT32                            pe1_r_sp_ctrl_05;		// 0x34a8 : ''
	PE_L9B0_PE1_R_SP_CTRL_06          pe1_r_sp_ctrl_06;		// 0x34ac : ''
	PE_L9B0_PE1_R_SP_CTRL_07          pe1_r_sp_ctrl_07;		// 0x34b0 : ''
	PE_L9B0_PE1_R_SP_CTRL_08          pe1_r_sp_ctrl_08;		// 0x34b4 : ''
	PE_L9B0_PE1_R_SP_CTRL_09          pe1_r_sp_ctrl_09;		// 0x34b8 : ''
	PE_L9B0_PE1_R_SP_CTRL_0A          pe1_r_sp_ctrl_0a;		// 0x34bc : ''
	PE_L9B0_PE1_R_SP_CTRL_0B          pe1_r_sp_ctrl_0b;		// 0x34c0 : ''
	PE_L9B0_PE1_R_SP_CTRL_0C          pe1_r_sp_ctrl_0c;		// 0x34c4 : ''
	UINT32                            reserved38[2];			// 0x34c8 ~ 0x34cc
	PE_L9B0_PE1_R_DEBUG_CTRL_00       pe1_r_debug_ctrl_00;		// 0x34d0 : ''
	UINT32                            pe1_r_debug_ctrl_01;		// 0x34d4 : ''
	UINT32                            reserved39[6];			// 0x34d8 ~ 0x34ec
	PE_L9B0_PE1_R_MP_CTRL_00          pe1_r_mp_ctrl_00;		// 0x34f0 : ''
	PE_L9B0_PE1_R_MP_CTRL_01          pe1_r_mp_ctrl_01;		// 0x34f4 : ''
	PE_L9B0_PE1_R_MP_CTRL_02          pe1_r_mp_ctrl_02;		// 0x34f8 : ''
	UINT32                            pe1_r_mp_ctrl_03;		// 0x34fc : ''
	PE_L9B0_PE1_R_MP_CTRL_04          pe1_r_mp_ctrl_04;		// 0x3500 : ''
	UINT32                            reserved40;				// 0x3504
	UINT32                            pe1_r_mp_ctrl_05;		// 0x3508 : ''
	PE_L9B0_PE1_R_MP_CTRL_06          pe1_r_mp_ctrl_06;		// 0x350c : ''
	PE_L9B0_PE1_R_MP_CTRL_07          pe1_r_mp_ctrl_07;		// 0x3510 : ''
	PE_L9B0_PE1_R_MP_CTRL_08          pe1_r_mp_ctrl_08;		// 0x3514 : ''
	PE_L9B0_PE1_R_MP_CTRL_09          pe1_r_mp_ctrl_09;		// 0x3518 : ''
	PE_L9B0_PE1_R_MP_CTRL_0A          pe1_r_mp_ctrl_0a;		// 0x351c : ''
	PE_L9B0_PE1_R_MP_CTRL_0B          pe1_r_mp_ctrl_0b;		// 0x3520 : ''
	PE_L9B0_PE1_R_MP_CTRL_0C          pe1_r_mp_ctrl_0c;		// 0x3524 : ''
	UINT32                            reserved41[2];			// 0x3528 ~ 0x352c
	PE_L9B0_PE1_R_CTI_CTRL_00         pe1_r_cti_ctrl_00;		// 0x3530 : ''
	UINT32                            pe1_r_cti_ctrl_01;		// 0x3534 : ''
	PE_L9B0_PE1_R_CTI_CTRL_02         pe1_r_cti_ctrl_02;		// 0x3538 : ''
	UINT32                            reserved42[5];			// 0x353c ~ 0x354c
	PE_L9B0_PE1_R_BLUR_CTRL           pe1_r_blur_ctrl;			// 0x3550 : ''
	UINT32                            reserved43[3];			// 0x3554 ~ 0x355c
	PE_L9B0_PE1_R_CORING_CTRL_00      pe1_r_coring_ctrl_00;	// 0x3560 : ''
	PE_L9B0_PE1_R_CORING_CTRL_01      pe1_r_coring_ctrl_01;	// 0x3564 : ''
	PE_L9B0_PE1_R_CORING_CTRL_02      pe1_r_coring_ctrl_02;	// 0x3568 : ''
	PE_L9B0_PE1_R_CORING_CTRL_03      pe1_r_coring_ctrl_03;	// 0x356c : ''
	PE_L9B0_PE1_R_CORING_CTRL_04      pe1_r_coring_ctrl_04;	// 0x3570 : ''
	PE_L9B0_PE1_R_CORING_CTRL_05      pe1_r_coring_ctrl_05;	// 0x3574 : ''
	PE_L9B0_PE1_R_CORING_CTRL_06      pe1_r_coring_ctrl_06;	// 0x3578 : ''
	PE_L9B0_PE1_R_CORING_CTRL_07      pe1_r_coring_ctrl_07;	// 0x357c : ''
	PE_L9B0_PE1_R_CORING_CTRL_08      pe1_r_coring_ctrl_08;	// 0x3580 : ''
	PE_L9B0_PE1_R_CORING_CTRL_09      pe1_r_coring_ctrl_09;	// 0x3584 : ''
	UINT32                            reserved44[2];			// 0x3588 ~ 0x358c
	PE_L9B0_PE1_R_DJ_CTRL_00          pe1_r_dj_ctrl_00;		// 0x3590 : ''
	PE_L9B0_PE1_R_DJ_CTRL_01          pe1_r_dj_ctrl_01;		// 0x3594 : ''
	PE_L9B0_PE1_R_DJ_CTRL_02          pe1_r_dj_ctrl_02;		// 0x3598 : ''
	PE_L9B0_PE1_R_DJ_CTRL_03          pe1_r_dj_ctrl_03;		// 0x359c : ''
	PE_L9B0_PE1_R_LEVEL_CTRL_00       pe1_r_level_ctrl_00;		// 0x35a0 : ''
	PE_L9B0_PE1_R_VSPYC_CTRL_00       pe1_r_vspyc_ctrl_00;		// 0x35a4 : ''
	PE_L9B0_PE1_R_VSPYC_CTRL_01       pe1_r_vspyc_ctrl_01;		// 0x35a8 : ''
	UINT32                            reserved45;				// 0x35ac
	PE_L9B0_PE1_R_VSPRGB_CTRL_00      pe1_r_vsprgb_ctrl_00;	// 0x35b0 : ''
	UINT32                            reserved46[3];			// 0x35b4 ~ 0x35bc
	PE_L9B0_PE1_R_XVY_CTRL_00         pe1_r_xvy_ctrl_00;		// 0x35c0 : ''
	PE_L9B0_PE1_R_XVY_CTRL_01         pe1_r_xvy_ctrl_01;		// 0x35c4 : ''
	PE_L9B0_PE1_R_XVY_CTRL_02         pe1_r_xvy_ctrl_02;		// 0x35c8 : ''
	PE_L9B0_PE1_R_XVY_CTRL_03         pe1_r_xvy_ctrl_03;		// 0x35cc : ''
	PE_L9B0_PE1_R_XVY_CTRL_04         pe1_r_xvy_ctrl_04;		// 0x35d0 : ''
	PE_L9B0_PE1_R_XVY_CTRL_05         pe1_r_xvy_ctrl_05;		// 0x35d4 : ''
	PE_L9B0_PE1_R_XVY_CTRL_06         pe1_r_xvy_ctrl_06;		// 0x35d8 : ''
	PE_L9B0_PE1_R_XVY_CTRL_07         pe1_r_xvy_ctrl_07;		// 0x35dc : ''
	PE_L9B0_PE1_R_XVY_CTRL_08         pe1_r_xvy_ctrl_08;		// 0x35e0 : ''
	PE_L9B0_PE1_R_XVY_CTRL_09         pe1_r_xvy_ctrl_09;		// 0x35e4 : ''
	PE_L9B0_PE1_R_XVY_CTRL_0A         pe1_r_xvy_ctrl_0a;		// 0x35e8 : ''
	PE_L9B0_PE1_R_XVY_CTRL_0B         pe1_r_xvy_ctrl_0b;		// 0x35ec : ''
	PE_L9B0_PE1_R_XVY_CTRL_0C         pe1_r_xvy_ctrl_0c;		// 0x35f0 : ''
	PE_L9B0_PE1_R_XVY_CTRL_0D         pe1_r_xvy_ctrl_0d;		// 0x35f4 : ''
	UINT32                            reserved47[2];			// 0x35f8 ~ 0x35fc
	PE_L9B0_PE1_R_CEN_CTRL_00         pe1_r_cen_ctrl_00;		// 0x3600 : ''
	PE_L9B0_PE1_R_CEN_CTRL_01         pe1_r_cen_ctrl_01;		// 0x3604 : ''
	PE_L9B0_PE1_R_CEN_CTRL_02         pe1_r_cen_ctrl_02;		// 0x3608 : ''
	PE_L9B0_PE1_R_CEN_CTRL_03         pe1_r_cen_ctrl_03;		// 0x360c : ''
	PE_L9B0_PE1_R_CEN_CTRL_04         pe1_r_cen_ctrl_04;		// 0x3610 : ''
	PE_L9B0_PE1_R_CEN_IA_CTRL         pe1_r_cen_ia_ctrl;		// 0x3614 : ''
	PE_L9B0_PE1_R_CEN_IA_DATA         pe1_r_cen_ia_data;		// 0x3618 : ''
	UINT32                            reserved48[5];			// 0x361c ~ 0x362c
	PE_L9B0_PE1_R_LRCR_CTRL_00        pe1_r_lrcr_ctrl_00;		// 0x3630 : ''
	PE_L9B0_PE1_R_LRCR_CTRL_01        pe1_r_lrcr_ctrl_01;		// 0x3634 : ''
	PE_L9B0_PE1_R_LRCR_CTRL_02        pe1_r_lrcr_ctrl_02;		// 0x3638 : ''
	PE_L9B0_PE1_R_LRCR_CTRL_03        pe1_r_lrcr_ctrl_03;		// 0x363c : ''
	PE_L9B0_PE1_R_LRCR_CTRL_04        pe1_r_lrcr_ctrl_04;		// 0x3640 : ''
	PE_L9B0_PE1_R_LRCR_CTRL_05        pe1_r_lrcr_ctrl_05;		// 0x3644 : ''
	PE_L9B0_PE1_R_LRCR_CTRL_06        pe1_r_lrcr_ctrl_06;		// 0x3648 : ''
	PE_L9B0_PE1_R_LRCR_CTRL_07        pe1_r_lrcr_ctrl_07;		// 0x364c : ''
	PE_L9B0_PE1_R_LRCR_STAT_00        pe1_r_lrcr_stat_00;		// 0x3650 : ''
	PE_L9B0_PE1_R_LRCR_STAT_01        pe1_r_lrcr_stat_01;		// 0x3654 : ''
	PE_L9B0_PE1_R_LRCR_STAT_02        pe1_r_lrcr_stat_02;		// 0x3658 : ''
	UINT32                            reserved49[5];			// 0x365c ~ 0x366c
	PE_L9B0_PE1_R_DCE_CTRL_00         pe1_r_dce_ctrl_00;		// 0x3670 : ''
	PE_L9B0_PE1_R_DCE_CTRL_01         pe1_r_dce_ctrl_01;		// 0x3674 : ''
	PE_L9B0_PE1_R_DCE_CTRL_02         pe1_r_dce_ctrl_02;		// 0x3678 : ''
	PE_L9B0_PE1_R_DCE_CTRL_03         pe1_r_dce_ctrl_03;		// 0x367c : ''
	PE_L9B0_PE1_R_DCE_CTRL_04         pe1_r_dce_ctrl_04;		// 0x3680 : ''
	PE_L9B0_PE1_R_DCE_CTRL_05         pe1_r_dce_ctrl_05;		// 0x3684 : ''
	PE_L9B0_PE1_R_DCE_IA_CTRL         pe1_r_dce_ia_ctrl;		// 0x3688 : ''
	PE_L9B0_PE1_R_DCE_IA_DATA         pe1_r_dce_ia_data;		// 0x368c : ''
	PE_L9B0_PE1_R_DCE_CTRL_08         pe1_r_dce_ctrl_08;		// 0x3690 : ''
	UINT32                            reserved50[3];			// 0x3694 ~ 0x369c
	PE_L9B0_PE1_R_DCE_HIST_IA_CTRL    pe1_r_dce_hist_ia_ctrl;	// 0x36a0 : ''
	UINT32                            pe1_r_dce_hist_ia_data1;	// 0x36a4 : ''
	UINT32                            pe1_r_dce_hsit_ia_data2;	// 0x36a8 : ''
	PE_L9B0_PE1_R_DSE_CTRL_00         pe1_r_dse_ctrl_00;		// 0x36ac : ''
	PE_L9B0_PE1_R_DSE_CTRL_01         pe1_r_dse_ctrl_01;		// 0x36b0 : ''
	PE_L9B0_PE1_R_DSE_CTRL_02         pe1_r_dse_ctrl_02;		// 0x36b4 : ''
	PE_L9B0_PE1_R_DSE_IA_CTRL         pe1_r_dse_ia_ctrl;		// 0x36b8 : ''
	PE_L9B0_PE1_R_DSE_IA_DATA         pe1_r_dse_ia_data;		// 0x36bc : ''
	PE_L9B0_PE1_R_WB_CTRL_00          pe1_r_wb_ctrl_00;		// 0x36c0 : ''
	PE_L9B0_PE1_R_WB_CTRL_01          pe1_r_wb_ctrl_01;		// 0x36c4 : ''
	PE_L9B0_PE1_R_WB_CTRL_02          pe1_r_wb_ctrl_02;		// 0x36c8 : ''
	UINT32                            reserved51[9];			// 0x36cc ~ 0x36ec
	PE_L9B0_PE1_R_GMC_CTRL_00         pe1_r_gmc_ctrl_00;		// 0x36f0 : ''
	PE_L9B0_PE1_R_GMC_CTRL_01         pe1_r_gmc_ctrl_01;		// 0x36f4 : ''
	PE_L9B0_PE1_R_GMC_CTRL_02         pe1_r_gmc_ctrl_02;		// 0x36f8 : ''
	PE_L9B0_PE1_R_GMC_IA_CTRL         pe1_r_gmc_ia_ctrl;		// 0x36fc : ''
	PE_L9B0_PE1_R_GMC_IA_DATA         pe1_r_gmc_ia_data;		// 0x3700 : ''
	PE_L9B0_PE1_R_GMC_CTRL_03         pe1_r_gmc_ctrl_03;		// 0x3704 : ''
	UINT32                            reserved52[6];			// 0x3708 ~ 0x371c
	PE_L9B0_PE1_R_SQM_CTRL_0          pe1_r_sqm_ctrl_0;		// 0x3720 : ''
	PE_L9B0_PE1_R_SQM_CTRL_1          pe1_r_sqm_ctrl_1;		// 0x3724 : ''
	PE_L9B0_PE1_R_SQM_CTRL_2          pe1_r_sqm_ctrl_2;		// 0x3728 : ''
	PE_L9B0_PE1_R_SQM_CTRL_3          pe1_r_sqm_ctrl_3;		// 0x372c : ''
	PE_L9B0_PE1_R_SQM_CTRL_4          pe1_r_sqm_ctrl_4;		// 0x3730 : ''
	PE_L9B0_PE1_R_SQM_CTRL_5          pe1_r_sqm_ctrl_5;		// 0x3734 : ''
	UINT32                            pe1_r_sqm_stat;			// 0x3738 : ''
	UINT32                            reserved53[5];			// 0x373c ~ 0x374c
	PE_L9B0_PE1_R_BBD2D_CTRL_0        pe1_r_bbd2d_ctrl_0;		// 0x3750 : ''
	PE_L9B0_PE1_R_BBD2D_CTRL_1        pe1_r_bbd2d_ctrl_1;		// 0x3754 : ''
	PE_L9B0_PE1_R_BBD2D_CTRL_2        pe1_r_bbd2d_ctrl_2;		// 0x3758 : ''
	PE_L9B0_PE1_R_BBD2D_STAT_0        pe1_r_bbd2d_stat_0;		// 0x375c : ''
	PE_L9B0_PE1_R_BBD2D_STAT_1        pe1_r_bbd2d_stat_1;		// 0x3760 : ''
	UINT32                            reserved54[3];			// 0x3764 ~ 0x376c
	PE_L9B0_PE1_R_BBD3D_CTRL_00       pe1_r_bbd3d_ctrl_00;		// 0x3770 : ''
	PE_L9B0_PE1_R_BBD3D_CTRL_01       pe1_r_bbd3d_ctrl_01;		// 0x3774 : ''
	PE_L9B0_PE1_R_BBD3D_CTRL_02       pe1_r_bbd3d_ctrl_02;		// 0x3778 : ''
	PE_L9B0_PE1_R_BBD3D_STAT_0        pe1_r_bbd3d_stat_0;		// 0x377c : ''
} PE_P1R_REG_L9B0_T;

#endif

